FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network.h
/*
 * Copyright (c) 2010 - 2021, Nordic Semiconductor ASA All rights reserved.SPDX-License-Identifier: BSD
 * -3-ClauseRedistribution and use in source and binary forms, with or withoutmodification, are permitt
 * ed provided that the following conditions are met:1. Redistributions of source code must retain the
 * above copyright notice, this list of conditions and the following disclaimer.2. Redistributions in b
 * inary form must reproduce the above copyright notice, this list of conditions and the following disc
 * laimer in the documentation and/or other materials provided with the distribution.3. Neither the nam
 * e of Nordic Semiconductor ASA nor the names of its contributors may be used to endorse or promote pr
 * oducts derived from this software without specific prior written permission.THIS SOFTWARE IS PROVIDE
 * D BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING,
 * BUT NOT LIMITED TO, THEIMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSEA
 * RE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BELIABLE FOR ANY DIRECT, I
 * NDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, ORCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PRO
 * CUREMENT OFSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESSINTERRUPTION) HOW
 * EVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER INCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE)ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THEP
 * OSSIBILITY OF SUCH DAMAGE.
 *
 * @file     nrf5340_network.h
 * @brief    CMSIS HeaderFile
 * @version  1
 * @date     19. November 2021
 * @note     Generated by SVDConv V3.3.35 on Friday, 19.11.2021 12:45:14
 *           from File 'nrf5340_network.svd',
 *           last modified on Friday, 19.11.2021 11:44:55
 */



/** @addtogroup Nordic Semiconductor
 * @{
 */


/** @addtogroup nrf5340_network
 * @{
 */


#ifndef NRF5340_NETWORK_H
    #define NRF5340_NETWORK_H

    #ifdef __cplusplus
    extern "C" {
    #endif


/** @addtogroup Configuration_of_CMSIS
 * @{
 */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

    typedef enum
    {
/* =======================================  ARM Cortex-M33 Specific Interrupt Numbers  ======================================= */
        Reset_IRQn = -15,                       /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
        NonMaskableInt_IRQn = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
        HardFault_IRQn = -13,                   /*!< -13  Hard Fault, all classes of Fault                                     */
        MemoryManagement_IRQn = -12,            /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                 *   and No Match                                                              */
        BusFault_IRQn = -11,                    /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                 *   related Fault                                                             */
        UsageFault_IRQn = -10,                  /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
        SecureFault_IRQn = -9,                  /*!< -9 Secure Fault Handler                                                   */
        SVCall_IRQn = -5,                       /*!< -5 System Service Call via SVC instruction                                */
        DebugMonitor_IRQn = -4,                 /*!< -4 Debug Monitor                                                          */
        PendSV_IRQn = -2,                       /*!< -2 Pendable request for system service                                    */
        SysTick_IRQn = -1,                      /*!< -1 System Tick Timer                                                      */
/* ======================================  nrf5340_network Specific Interrupt Numbers  ======================================= */
        CLOCK_POWER_IRQn = 5,                   /*!< 5  CLOCK_POWER                                                            */
        RADIO_IRQn = 8,                         /*!< 8  RADIO                                                                  */
        RNG_IRQn = 9,                           /*!< 9  RNG                                                                    */
        GPIOTE_IRQn = 10,                       /*!< 10 GPIOTE                                                                 */
        WDT_IRQn = 11,                          /*!< 11 WDT                                                                    */
        TIMER0_IRQn = 12,                       /*!< 12 TIMER0                                                                 */
        ECB_IRQn = 13,                          /*!< 13 ECB                                                                    */
        AAR_CCM_IRQn = 14,                      /*!< 14 AAR_CCM                                                                */
        TEMP_IRQn = 16,                         /*!< 16 TEMP                                                                   */
        RTC0_IRQn = 17,                         /*!< 17 RTC0                                                                   */
        IPC_IRQn = 18,                          /*!< 18 IPC                                                                    */
        SERIAL0_IRQn = 19,                      /*!< 19 SERIAL0                                                                */
        EGU0_IRQn = 20,                         /*!< 20 EGU0                                                                   */
        RTC1_IRQn = 22,                         /*!< 22 RTC1                                                                   */
        TIMER1_IRQn = 24,                       /*!< 24 TIMER1                                                                 */
        TIMER2_IRQn = 25,                       /*!< 25 TIMER2                                                                 */
        SWI0_IRQn = 26,                         /*!< 26 SWI0                                                                   */
        SWI1_IRQn = 27,                         /*!< 27 SWI1                                                                   */
        SWI2_IRQn = 28,                         /*!< 28 SWI2                                                                   */
        SWI3_IRQn = 29                          /*!< 29 SWI3                                                                   */
    } IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

