FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network.h
/* ==========================  Configuration of the ARM Cortex-M33 Processor and Core Peripherals  =========================== */
    #define __CM33_REV                0x0004U   /*!< CM33 Core Revision                                                        */
    #define __DSP_PRESENT             0         /*!< DSP present or not                                                        */
    #define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels                                   */
    #define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used                              */
    #define __VTOR_PRESENT            1         /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
    #define __MPU_PRESENT             1         /*!< MPU present                                                               */
    #define __FPU_PRESENT             0         /*!< FPU present                                                               */
    #define __FPU_DP                  0         /*!< unused, Device has no FPU                                                 */
    #define __SAUREGION_PRESENT       0         /*!< SAU region present                                                        */


/** @} */ /* End of group Configuration_of_CMSIS */

    #include "core_cm33.h"                      /*!< ARM Cortex-M33 processor and core peripherals                             */
    #include "system_nrf5340_network.h"         /*!< nrf5340_network System                                                    */

    #ifndef __IM                                /*!< Fallback for older CMSIS versions                                         */
        #define __IM     __I
    #endif
    #ifndef __OM                                /*!< Fallback for older CMSIS versions                                         */
        #define __OM     __O
    #endif
    #ifndef __IOM                               /*!< Fallback for older CMSIS versions                                         */
        #define __IOM    __IO
    #endif


/* =========================================================================================================================== */
/* ================                              Device Specific Cluster Section                              ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_clusters
 * @{
 */


/**
 * @brief FICR_INFO [INFO] (Device info)
 */
    typedef struct
    {
        __IM uint32_t CONFIGID;                 /*!< (@ 0x00000000) Configuration identifier                                   */
        __IM uint32_t DEVICEID[ 2 ];            /*!< (@ 0x00000004) Description collection: Device identifier                  */
        __IM uint32_t PART;                     /*!< (@ 0x0000000C) Part code                                                  */
        __IM uint32_t VARIANT;                  /*!< (@ 0x00000010) Part Variant, Hardware version and Production
                                                 *                  configuration                                              */
        __IM uint32_t PACKAGE;                  /*!< (@ 0x00000014) Package option                                             */
        __IM uint32_t RAM;                      /*!< (@ 0x00000018) RAM variant                                                */
        __IM uint32_t FLASH;                    /*!< (@ 0x0000001C) Flash variant                                              */
        __IM uint32_t CODEPAGESIZE;             /*!< (@ 0x00000020) Code memory page size in bytes                             */
        __IM uint32_t CODESIZE;                 /*!< (@ 0x00000024) Code memory size                                           */
        __IM uint32_t DEVICETYPE;               /*!< (@ 0x00000028) Device type                                                */
    } FICR_INFO_Type;                           /*!< Size = 44 (0x2c)                                                          */


/**
 * @brief FICR_TRIMCNF [TRIMCNF] (Unspecified)
 */
    typedef struct
    {
        __IM uint32_t * ADDR;                   /*!< (@ 0x00000000) Description cluster: Address                               */
        __IM uint32_t DATA;                     /*!< (@ 0x00000004) Description cluster: Data                                  */
    } FICR_TRIMCNF_Type;                        /*!< Size = 8 (0x8)                                                            */


/**
 * @brief VREQCTRL_VREGRADIO [VREGRADIO] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t VREQH;                   /*!< (@ 0x00000000) Request high voltage on RADIO After requesting
                                                 *                  high voltage, the user must wait until VREQHREADY
                                                 *                  is set to Ready                                            */
        __IM uint32_t RESERVED;
        __IM uint32_t VREQHREADY;               /*!< (@ 0x00000008) High voltage on RADIO is ready                             */
    } VREQCTRL_VREGRADIO_Type;                  /*!< Size = 12 (0xc)                                                           */


/**
 * @brief CTRLAPPERI_MAILBOX [MAILBOX] (Unspecified)
 */
    typedef struct
    {
        __IM uint32_t RXDATA;                   /*!< (@ 0x00000000) Data sent from the debugger to the CPU.                    */
        __IM uint32_t RXSTATUS;                 /*!< (@ 0x00000004) This register shows a status that indicates if
                                                 *                  data sent from the debugger to the CPU has
                                                 *                  been read.                                                 */
        __IM uint32_t RESERVED[ 30 ];
        __IOM uint32_t TXDATA;                  /*!< (@ 0x00000080) Data sent from the CPU to the debugger.                    */
        __IM uint32_t TXSTATUS;                 /*!< (@ 0x00000084) This register shows a status that indicates if
                                                 *                  the data sent from the CPU to the debugger
                                                 *                  has been read.                                             */
    } CTRLAPPERI_MAILBOX_Type;                  /*!< Size = 136 (0x88)                                                         */


/**
 * @brief CTRLAPPERI_ERASEPROTECT [ERASEPROTECT] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t LOCK;                    /*!< (@ 0x00000000) This register locks the ERASEPROTECT.DISABLE
                                                 *                  register from being written until next reset.              */
        __IOM uint32_t DISABLE;                 /*!< (@ 0x00000004) This register disables the ERASEPROTECT register
                                                 *                  and performs an ERASEALL operation.                        */
    } CTRLAPPERI_ERASEPROTECT_Type;             /*!< Size = 8 (0x8)                                                            */


/**
 * @brief CTRLAPPERI_APPROTECT [APPROTECT] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t LOCK;                    /*!< (@ 0x00000000) This register locks the APPROTECT.DISABLE register
                                                 *                  from being written to until next reset.                    */
        __IOM uint32_t DISABLE;                 /*!< (@ 0x00000004) This register disables the APPROTECT register
                                                 *                  and enables debug access to non-secure mode.               */
    } CTRLAPPERI_APPROTECT_Type;                /*!< Size = 8 (0x8)                                                            */


/**
 * @brief RADIO_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t DFEGPIO[ 8 ];            /*!< (@ 0x00000000) Description collection: Pin select for DFE pin
                                                 *                  n                                                          */
    } RADIO_PSEL_Type;                          /*!< Size = 32 (0x20)                                                          */


/**
 * @brief RADIO_DFEPACKET [DFEPACKET] (DFE packet EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of buffer words to transfer                 */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of samples transferred in the last transaction      */
    } RADIO_DFEPACKET_Type;                     /*!< Size = 12 (0xc)                                                           */


/**
 * @brief DPPIC_TASKS_CHG [TASKS_CHG] (Channel group tasks)
 */
    typedef struct
    {
        __OM uint32_t EN;                       /*!< (@ 0x00000000) Description cluster: Enable channel group n                */
        __OM uint32_t DIS;                      /*!< (@ 0x00000004) Description cluster: Disable channel group n               */
    } DPPIC_TASKS_CHG_Type;                     /*!< Size = 8 (0x8)                                                            */


/**
 * @brief DPPIC_SUBSCRIBE_CHG [SUBSCRIBE_CHG] (Subscribe configuration for tasks)
 */
    typedef struct
    {
        __IOM uint32_t EN;                      /*!< (@ 0x00000000) Description cluster: Subscribe configuration
                                                 *                  for task CHG[n].EN                                         */
        __IOM uint32_t DIS;                     /*!< (@ 0x00000004) Description cluster: Subscribe configuration
                                                 *                  for task CHG[n].DIS                                        */
    } DPPIC_SUBSCRIBE_CHG_Type;                 /*!< Size = 8 (0x8)                                                            */


/**
 * @brief SPIM_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCK;                     /*!< (@ 0x00000000) Pin select for SCK                                         */
        __IOM uint32_t MOSI;                    /*!< (@ 0x00000004) Pin select for MOSI signal                                 */
        __IOM uint32_t MISO;                    /*!< (@ 0x00000008) Pin select for MISO signal                                 */
        __IOM uint32_t CSN;                     /*!< (@ 0x0000000C) Pin select for CSN                                         */
    } SPIM_PSEL_Type;                           /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SPIM_RXD [RXD] (RXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in receive buffer                  */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } SPIM_RXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SPIM_TXD [TXD] (TXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Number of bytes in transmit buffer                         */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } SPIM_TXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SPIM_IFTIMING [IFTIMING] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t RXDELAY;                 /*!< (@ 0x00000000) Sample delay for input serial data on MISO                 */
        __IOM uint32_t CSNDUR;                  /*!< (@ 0x00000004) Minimum duration between edge of CSN and edge
                                                 *                  of SCK. When SHORTS.END_START is used, this
                                                 *                  is also the minimum duration CSN must stay
                                                 *                  high between transactions.                                 */
    } SPIM_IFTIMING_Type;                       /*!< Size = 8 (0x8)                                                            */


/**
 * @brief SPIS_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCK;                     /*!< (@ 0x00000000) Pin select for SCK                                         */
        __IOM uint32_t MISO;                    /*!< (@ 0x00000004) Pin select for MISO signal                                 */
        __IOM uint32_t MOSI;                    /*!< (@ 0x00000008) Pin select for MOSI signal                                 */
        __IOM uint32_t CSN;                     /*!< (@ 0x0000000C) Pin select for CSN signal                                  */
    } SPIS_PSEL_Type;                           /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SPIS_RXD [RXD] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) RXD data pointer                                           */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in receive buffer                  */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes received in last granted transaction       */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } SPIS_RXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SPIS_TXD [TXD] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) TXD data pointer                                           */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transmitted in last granted transaction    */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } SPIS_TXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief TWIM_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCL;                     /*!< (@ 0x00000000) Pin select for SCL signal                                  */
        __IOM uint32_t SDA;                     /*!< (@ 0x00000004) Pin select for SDA signal                                  */
    } TWIM_PSEL_Type;                           /*!< Size = 8 (0x8)                                                            */


/**
 * @brief TWIM_RXD [RXD] (RXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in receive buffer                  */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIM_RXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief TWIM_TXD [TXD] (TXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIM_TXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief TWIS_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCL;                     /*!< (@ 0x00000000) Pin select for SCL signal                                  */
        __IOM uint32_t SDA;                     /*!< (@ 0x00000004) Pin select for SDA signal                                  */
    } TWIS_PSEL_Type;                           /*!< Size = 8 (0x8)                                                            */


/**
 * @brief TWIS_RXD [RXD] (RXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) RXD Data pointer                                           */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in RXD buffer                      */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last RXD transaction    */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIS_RXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief TWIS_TXD [TXD] (TXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) TXD Data pointer                                           */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in TXD buffer                      */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last TXD transaction    */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIS_TXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief UARTE_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t RTS;                     /*!< (@ 0x00000000) Pin select for RTS signal                                  */
        __IOM uint32_t TXD;                     /*!< (@ 0x00000004) Pin select for TXD signal                                  */
        __IOM uint32_t CTS;                     /*!< (@ 0x00000008) Pin select for CTS signal                                  */
        __IOM uint32_t RXD;                     /*!< (@ 0x0000000C) Pin select for RXD signal                                  */
    } UARTE_PSEL_Type;                          /*!< Size = 16 (0x10)                                                          */


/**
 * @brief UARTE_RXD [RXD] (RXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in receive buffer                  */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
    } UARTE_RXD_Type;                           /*!< Size = 12 (0xc)                                                           */


/**
 * @brief UARTE_TXD [TXD] (TXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
    } UARTE_TXD_Type;                           /*!< Size = 12 (0xc)                                                           */


/**
 * @brief ACL_ACL [ACL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t ADDR;                    /*!< (@ 0x00000000) Description cluster: Start address of region
                                                 *                  to protect. The start address must be word-aligned.        */
        __IOM uint32_t SIZE;                    /*!< (@ 0x00000004) Description cluster: Size of region to protect
                                                 *                  counting from address ACL[n].ADDR. Writing
                                                 *                  a '0' has no effect.                                       */
        __IOM uint32_t PERM;                    /*!< (@ 0x00000008) Description cluster: Access permissions for region
                                                 *                  n as defined by start address ACL[n].ADDR
                                                 *                  and size ACL[n].SIZE                                       */
        __IM uint32_t RESERVED;
    } ACL_ACL_Type;                             /*!< Size = 16 (0x10)                                                          */


/**
 * @brief VMC_RAM [RAM] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t POWER;                   /*!< (@ 0x00000000) Description cluster: RAM[n] power control register         */
        __IOM uint32_t POWERSET;                /*!< (@ 0x00000004) Description cluster: RAM[n] power control set
                                                 *                  register                                                   */
        __IOM uint32_t POWERCLR;                /*!< (@ 0x00000008) Description cluster: RAM[n] power control clear
                                                 *                  register                                                   */
        __IM uint32_t RESERVED;
    } VMC_RAM_Type;                             /*!< Size = 16 (0x10)                                                          */


/** @} */ /* End of group Device_Peripheral_clusters */


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
 * @{
 */



