FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network.h
/* =========================================================================================================================== */
/* ================                                          FICR_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Factory Information Configuration Registers (FICR_NS)
 */

    typedef struct                              /*!< (@ 0x01FF0000) FICR_NS Structure                                          */
    {
        __IM uint32_t RESERVED[ 128 ];
        __IOM FICR_INFO_Type INFO;              /*!< (@ 0x00000200) Device info                                                */
        __IM uint32_t RESERVED1[ 21 ];
        __IM uint32_t ER[ 4 ];                  /*!< (@ 0x00000280) Description collection: Encryption Root, word
                                                 *                  n                                                          */
        __IM uint32_t IR[ 4 ];                  /*!< (@ 0x00000290) Description collection: Identity Root, word n              */
        __IM uint32_t DEVICEADDRTYPE;           /*!< (@ 0x000002A0) Device address type                                        */
        __IM uint32_t DEVICEADDR[ 2 ];          /*!< (@ 0x000002A4) Description collection: Device address n                   */
        __IM uint32_t RESERVED2[ 21 ];
        __IOM FICR_TRIMCNF_Type TRIMCNF[ 32 ];  /*!< (@ 0x00000300) Unspecified                                                */
    } NRF_FICR_Type;                            /*!< Size = 1024 (0x400)                                                       */



/* =========================================================================================================================== */
/* ================                                          UICR_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief User Information Configuration Registers (UICR_NS)
 */

    typedef struct                              /*!< (@ 0x01FF8000) UICR_NS Structure                                          */
    {
        __IOM uint32_t APPROTECT;               /*!< (@ 0x00000000) Access port protection                                     */
        __IOM uint32_t ERASEPROTECT;            /*!< (@ 0x00000004) Erase protection                                           */
        __IM uint32_t RESERVED[ 126 ];
        __IOM uint32_t NRFFW[ 32 ];             /*!< (@ 0x00000200) Description collection: Reserved for Nordic firmware
                                                 *                  design                                                     */
        __IM uint32_t RESERVED1[ 32 ];
        __IOM uint32_t CUSTOMER[ 32 ];          /*!< (@ 0x00000300) Description collection: Reserved for customer              */
    } NRF_UICR_Type;                            /*!< Size = 896 (0x380)                                                        */



/* =========================================================================================================================== */
/* ================                                          CTI_NS                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Cross-Trigger Interface control. NOTE: this is not a separate peripheral, but describes CM33 functionality. (CTI_NS)
 */

    typedef struct                              /*!< (@ 0xE0042000) CTI_NS Structure                                           */
    {
        __IOM uint32_t CTICONTROL;              /*!< (@ 0x00000000) CTI Control register                                       */
        __IM uint32_t RESERVED[ 3 ];
        __OM uint32_t CTIINTACK;                /*!< (@ 0x00000010) CTI Interrupt Acknowledge register                         */
        __IOM uint32_t CTIAPPSET;               /*!< (@ 0x00000014) CTI Application Trigger Set register                       */
        __OM uint32_t CTIAPPCLEAR;              /*!< (@ 0x00000018) CTI Application Trigger Clear register                     */
        __OM uint32_t CTIAPPPULSE;              /*!< (@ 0x0000001C) CTI Application Pulse register                             */
        __IOM uint32_t CTIINEN[ 8 ];            /*!< (@ 0x00000020) Description collection: CTI Trigger input                  */
        __IM uint32_t RESERVED1[ 24 ];
        __IOM uint32_t CTIOUTEN[ 8 ];           /*!< (@ 0x000000A0) Description collection: CTI Trigger output                 */
        __IM uint32_t RESERVED2[ 28 ];
        __IM uint32_t CTITRIGINSTATUS;          /*!< (@ 0x00000130) CTI Trigger In Status register                             */
        __IM uint32_t CTITRIGOUTSTATUS;         /*!< (@ 0x00000134) CTI Trigger Out Status register                            */
        __IM uint32_t CTICHINSTATUS;            /*!< (@ 0x00000138) CTI Channel In Status register                             */
        __IM uint32_t RESERVED3;
        __IOM uint32_t CTIGATE;                 /*!< (@ 0x00000140) Enable CTI Channel Gate register                           */
        __IM uint32_t RESERVED4[ 926 ];
        __IM uint32_t DEVARCH;                  /*!< (@ 0x00000FBC) Device Architecture register                               */
        __IM uint32_t RESERVED5[ 2 ];
        __IM uint32_t DEVID;                    /*!< (@ 0x00000FC8) Device Configuration register                              */
        __IM uint32_t DEVTYPE;                  /*!< (@ 0x00000FCC) Device Type Identifier register                            */
        __IM uint32_t PIDR4;                    /*!< (@ 0x00000FD0) Peripheral ID4 Register                                    */
        __IM uint32_t PIDR5;                    /*!< (@ 0x00000FD4) Peripheral ID5 register                                    */
        __IM uint32_t PIDR6;                    /*!< (@ 0x00000FD8) Peripheral ID6 register                                    */
        __IM uint32_t PIDR7;                    /*!< (@ 0x00000FDC) Peripheral ID7 register                                    */
        __IM uint32_t PIDR0;                    /*!< (@ 0x00000FE0) Peripheral ID0 Register                                    */
        __IM uint32_t PIDR1;                    /*!< (@ 0x00000FE4) Peripheral ID1 Register                                    */
        __IM uint32_t PIDR2;                    /*!< (@ 0x00000FE8) Peripheral ID2 Register                                    */
        __IM uint32_t PIDR3;                    /*!< (@ 0x00000FEC) Peripheral ID3 Register                                    */
        __IM uint32_t CIDR0;                    /*!< (@ 0x00000FF0) Component ID0 Register                                     */
        __IM uint32_t CIDR1;                    /*!< (@ 0x00000FF4) Component ID1 Register                                     */
        __IM uint32_t CIDR2;                    /*!< (@ 0x00000FF8) Component ID2 Register                                     */
        __IM uint32_t CIDR3;                    /*!< (@ 0x00000FFC) Component ID3 Register                                     */
    } NRF_CTI_Type;                             /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                          DCNF_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Domain configuration management (DCNF_NS)
 */

    typedef struct                              /*!< (@ 0x41000000) DCNF_NS Structure                                          */
    {
        __IM uint32_t RESERVED[ 264 ];
        __IM uint32_t CPUID;                    /*!< (@ 0x00000420) CPU ID of this subsystem                                   */
    } NRF_DCNF_Type;                            /*!< Size = 1060 (0x424)                                                       */



/* =========================================================================================================================== */
/* ================                                        VREQCTRL_NS                                        ================ */
/* =========================================================================================================================== */


/**
 * @brief Voltage request control (VREQCTRL_NS)
 */

    typedef struct                              /*!< (@ 0x41004000) VREQCTRL_NS Structure                                      */
    {
        __IM uint32_t RESERVED[ 320 ];
        __IOM VREQCTRL_VREGRADIO_Type VREGRADIO; /*!< (@ 0x00000500) Unspecified                                                */
    } NRF_VREQCTRL_Type;                         /*!< Size = 1292 (0x50c)                                                       */



/* =========================================================================================================================== */
/* ================                                         CLOCK_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Clock management (CLOCK_NS)
 */

    typedef struct                              /*!< (@ 0x41005000) CLOCK_NS Structure                                         */
    {
        __OM uint32_t TASKS_HFCLKSTART;         /*!< (@ 0x00000000) Start HFCLK128M/HFCLK64M source as selected in
                                                 *                  HFCLKSRC                                                   */
        __OM uint32_t TASKS_HFCLKSTOP;          /*!< (@ 0x00000004) Stop HFCLK128M/HFCLK64M source                             */
        __OM uint32_t TASKS_LFCLKSTART;         /*!< (@ 0x00000008) Start LFCLK source as selected in LFCLKSRC                 */
        __OM uint32_t TASKS_LFCLKSTOP;          /*!< (@ 0x0000000C) Stop LFCLK source                                          */
        __OM uint32_t TASKS_CAL;                /*!< (@ 0x00000010) Start calibration of LFRC oscillator                       */
        __IM uint32_t RESERVED[ 27 ];
        __IOM uint32_t SUBSCRIBE_HFCLKSTART;    /*!< (@ 0x00000080) Subscribe configuration for task HFCLKSTART                */
        __IOM uint32_t SUBSCRIBE_HFCLKSTOP;     /*!< (@ 0x00000084) Subscribe configuration for task HFCLKSTOP                 */
        __IOM uint32_t SUBSCRIBE_LFCLKSTART;    /*!< (@ 0x00000088) Subscribe configuration for task LFCLKSTART                */
        __IOM uint32_t SUBSCRIBE_LFCLKSTOP;     /*!< (@ 0x0000008C) Subscribe configuration for task LFCLKSTOP                 */
        __IOM uint32_t SUBSCRIBE_CAL;           /*!< (@ 0x00000090) Subscribe configuration for task CAL                       */
        __IM uint32_t RESERVED1[ 27 ];
        __IOM uint32_t EVENTS_HFCLKSTARTED;     /*!< (@ 0x00000100) HFCLK128M/HFCLK64M source started                          */
        __IOM uint32_t EVENTS_LFCLKSTARTED;     /*!< (@ 0x00000104) LFCLK source started                                       */
        __IM uint32_t RESERVED2[ 5 ];
        __IOM uint32_t EVENTS_DONE;             /*!< (@ 0x0000011C) Calibration of LFRC oscillator complete event              */
        __IM uint32_t RESERVED3[ 24 ];
        __IOM uint32_t PUBLISH_HFCLKSTARTED;    /*!< (@ 0x00000180) Publish configuration for event HFCLKSTARTED               */
        __IOM uint32_t PUBLISH_LFCLKSTARTED;    /*!< (@ 0x00000184) Publish configuration for event LFCLKSTARTED               */
        __IM uint32_t RESERVED4[ 5 ];
        __IOM uint32_t PUBLISH_DONE;            /*!< (@ 0x0000019C) Publish configuration for event DONE                       */
        __IM uint32_t RESERVED5[ 88 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t INTPEND;                  /*!< (@ 0x0000030C) Pending interrupts                                         */
        __IM uint32_t RESERVED6[ 62 ];
        __IM uint32_t HFCLKRUN;                 /*!< (@ 0x00000408) Status indicating that HFCLKSTART task has been
                                                 *                  triggered                                                  */
        __IM uint32_t HFCLKSTAT;                /*!< (@ 0x0000040C) Status indicating which HFCLK128M/HFCLK64M source
                                                 *                  is running This register value in any CLOCK
                                                 *                  instance reflects status only due to configurations/action
                                                 *                  in that CLOCK instance.                                    */
        __IM uint32_t RESERVED7;
        __IM uint32_t LFCLKRUN;                 /*!< (@ 0x00000414) Status indicating that LFCLKSTART task has been
                                                 *                  triggered                                                  */
        __IM uint32_t LFCLKSTAT;                /*!< (@ 0x00000418) Status indicating which LFCLK source is running
                                                 *                  This register value in any CLOCK instance
                                                 *                  reflects status only due to configurations/actions
                                                 *                  in that CLOCK instance.                                    */
        __IM uint32_t LFCLKSRCCOPY;             /*!< (@ 0x0000041C) Copy of LFCLKSRC register, set when LFCLKSTART
                                                 *                  task was triggered                                         */
        __IM uint32_t RESERVED8[ 61 ];
        __IOM uint32_t HFCLKSRC;                /*!< (@ 0x00000514) Clock source for HFCLK128M/HFCLK64M                        */
        __IOM uint32_t LFCLKSRC;                /*!< (@ 0x00000518) Clock source for LFCLK                                     */
        __IM uint32_t RESERVED9[ 15 ];
        __IOM uint32_t HFCLKCTRL;               /*!< (@ 0x00000558) HFCLK128M frequency configuration                          */
        __IM uint32_t RESERVED10[ 5 ];
        __IOM uint32_t HFCLKALWAYSRUN;          /*!< (@ 0x00000570) Automatic or manual control of HFCLK128M/HFCLK64M          */
        __IOM uint32_t LFCLKALWAYSRUN;          /*!< (@ 0x00000574) Automatic or manual control of LFCLK                       */
    } NRF_CLOCK_Type;                           /*!< Size = 1400 (0x578)                                                       */



/* =========================================================================================================================== */
/* ================                                         POWER_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Power control (POWER_NS)
 */

    typedef struct                              /*!< (@ 0x41005000) POWER_NS Structure                                         */
    {
        __IM uint32_t RESERVED[ 30 ];
        __OM uint32_t TASKS_CONSTLAT;           /*!< (@ 0x00000078) Enable Constant Latency mode                               */
        __OM uint32_t TASKS_LOWPWR;             /*!< (@ 0x0000007C) Enable Low-Power mode (variable latency)                   */
        __IM uint32_t RESERVED1[ 30 ];
        __IOM uint32_t SUBSCRIBE_CONSTLAT;      /*!< (@ 0x000000F8) Subscribe configuration for task CONSTLAT                  */
        __IOM uint32_t SUBSCRIBE_LOWPWR;        /*!< (@ 0x000000FC) Subscribe configuration for task LOWPWR                    */
        __IM uint32_t RESERVED2[ 2 ];
        __IOM uint32_t EVENTS_POFWARN;          /*!< (@ 0x00000108) Power failure warning                                      */
        __IM uint32_t RESERVED3[ 2 ];
        __IOM uint32_t EVENTS_SLEEPENTER;       /*!< (@ 0x00000114) CPU entered WFI/WFE sleep                                  */
        __IOM uint32_t EVENTS_SLEEPEXIT;        /*!< (@ 0x00000118) CPU exited WFI/WFE sleep                                   */
        __IM uint32_t RESERVED4[ 27 ];
        __IOM uint32_t PUBLISH_POFWARN;         /*!< (@ 0x00000188) Publish configuration for event POFWARN                    */
        __IM uint32_t RESERVED5[ 2 ];
        __IOM uint32_t PUBLISH_SLEEPENTER;      /*!< (@ 0x00000194) Publish configuration for event SLEEPENTER                 */
        __IOM uint32_t PUBLISH_SLEEPEXIT;       /*!< (@ 0x00000198) Publish configuration for event SLEEPEXIT                  */
        __IM uint32_t RESERVED6[ 89 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED7[ 132 ];
        __IOM uint32_t GPREGRET[ 2 ];           /*!< (@ 0x0000051C) Description collection: General purpose retention
                                                 *                  register                                                   */
    } NRF_POWER_Type;                           /*!< Size = 1316 (0x524)                                                       */



/* =========================================================================================================================== */
/* ================                                         RESET_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Reset control (RESET_NS)
 */

