FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network.h
    typedef struct                              /*!< (@ 0x41005000) RESET_NS Structure                                         */
    {
        __IM uint32_t RESERVED[ 256 ];
        __IOM uint32_t RESETREAS;               /*!< (@ 0x00000400) Reset reason                                               */
    } NRF_RESET_Type;                           /*!< Size = 1028 (0x404)                                                       */



/* =========================================================================================================================== */
/* ================                                         CTRLAP_NS                                         ================ */
/* =========================================================================================================================== */


/**
 * @brief Control access port (CTRLAP_NS)
 */

    typedef struct                              /*!< (@ 0x41006000) CTRLAP_NS Structure                                        */
    {
        __IM uint32_t RESERVED[ 256 ];
        __IOM CTRLAPPERI_MAILBOX_Type MAILBOX;           /*!< (@ 0x00000400) Unspecified                                                */
        __IM uint32_t RESERVED1[ 30 ];
        __IOM CTRLAPPERI_ERASEPROTECT_Type ERASEPROTECT; /*!< (@ 0x00000500) Unspecified                                              */
        __IM uint32_t RESERVED2[ 14 ];
        __IOM CTRLAPPERI_APPROTECT_Type APPROTECT;       /*!< (@ 0x00000540) Unspecified                                                */
        __IM uint32_t RESERVED3[ 46 ];
        __IM uint32_t STATUS;                            /*!< (@ 0x00000600) Status bits for CTRL-AP peripheral.                        */
    } NRF_CTRLAPPERI_Type;                               /*!< Size = 1540 (0x604)                                                       */



/* =========================================================================================================================== */
/* ================                                         RADIO_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief 2.4 GHz radio (RADIO_NS)
 */

    typedef struct                              /*!< (@ 0x41008000) RADIO_NS Structure                                         */
    {
        __OM uint32_t TASKS_TXEN;               /*!< (@ 0x00000000) Enable RADIO in TX mode                                    */
        __OM uint32_t TASKS_RXEN;               /*!< (@ 0x00000004) Enable RADIO in RX mode                                    */
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000008) Start RADIO                                                */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x0000000C) Stop RADIO                                                 */
        __OM uint32_t TASKS_DISABLE;            /*!< (@ 0x00000010) Disable RADIO                                              */
        __OM uint32_t TASKS_RSSISTART;          /*!< (@ 0x00000014) Start the RSSI and take one single sample of
                                                 *                  the receive signal strength                                */
        __OM uint32_t TASKS_RSSISTOP;           /*!< (@ 0x00000018) Stop the RSSI measurement                                  */
        __OM uint32_t TASKS_BCSTART;            /*!< (@ 0x0000001C) Start the bit counter                                      */
        __OM uint32_t TASKS_BCSTOP;             /*!< (@ 0x00000020) Stop the bit counter                                       */
        __OM uint32_t TASKS_EDSTART;            /*!< (@ 0x00000024) Start the energy detect measurement used in IEEE
                                                 *                  802.15.4 mode                                              */
        __OM uint32_t TASKS_EDSTOP;             /*!< (@ 0x00000028) Stop the energy detect measurement                         */
        __OM uint32_t TASKS_CCASTART;           /*!< (@ 0x0000002C) Start the clear channel assessment used in IEEE
                                                 *                  802.15.4 mode                                              */
        __OM uint32_t TASKS_CCASTOP;            /*!< (@ 0x00000030) Stop the clear channel assessment                          */
        __IM uint32_t RESERVED[ 19 ];
        __IOM uint32_t SUBSCRIBE_TXEN;          /*!< (@ 0x00000080) Subscribe configuration for task TXEN                      */
        __IOM uint32_t SUBSCRIBE_RXEN;          /*!< (@ 0x00000084) Subscribe configuration for task RXEN                      */
        __IOM uint32_t SUBSCRIBE_START;         /*!< (@ 0x00000088) Subscribe configuration for task START                     */
        __IOM uint32_t SUBSCRIBE_STOP;          /*!< (@ 0x0000008C) Subscribe configuration for task STOP                      */
        __IOM uint32_t SUBSCRIBE_DISABLE;       /*!< (@ 0x00000090) Subscribe configuration for task DISABLE                   */
        __IOM uint32_t SUBSCRIBE_RSSISTART;     /*!< (@ 0x00000094) Subscribe configuration for task RSSISTART                 */
        __IOM uint32_t SUBSCRIBE_RSSISTOP;      /*!< (@ 0x00000098) Subscribe configuration for task RSSISTOP                  */
        __IOM uint32_t SUBSCRIBE_BCSTART;       /*!< (@ 0x0000009C) Subscribe configuration for task BCSTART                   */
        __IOM uint32_t SUBSCRIBE_BCSTOP;        /*!< (@ 0x000000A0) Subscribe configuration for task BCSTOP                    */
        __IOM uint32_t SUBSCRIBE_EDSTART;       /*!< (@ 0x000000A4) Subscribe configuration for task EDSTART                   */
        __IOM uint32_t SUBSCRIBE_EDSTOP;        /*!< (@ 0x000000A8) Subscribe configuration for task EDSTOP                    */
        __IOM uint32_t SUBSCRIBE_CCASTART;      /*!< (@ 0x000000AC) Subscribe configuration for task CCASTART                  */
        __IOM uint32_t SUBSCRIBE_CCASTOP;       /*!< (@ 0x000000B0) Subscribe configuration for task CCASTOP                   */
        __IM uint32_t RESERVED1[ 19 ];
        __IOM uint32_t EVENTS_READY;            /*!< (@ 0x00000100) RADIO has ramped up and is ready to be started             */
        __IOM uint32_t EVENTS_ADDRESS;          /*!< (@ 0x00000104) Address sent or received                                   */
        __IOM uint32_t EVENTS_PAYLOAD;          /*!< (@ 0x00000108) Packet payload sent or received                            */
        __IOM uint32_t EVENTS_END;              /*!< (@ 0x0000010C) Packet sent or received                                    */
        __IOM uint32_t EVENTS_DISABLED;         /*!< (@ 0x00000110) RADIO has been disabled                                    */
        __IOM uint32_t EVENTS_DEVMATCH;         /*!< (@ 0x00000114) A device address match occurred on the last received
                                                 *                  packet                                                     */
        __IOM uint32_t EVENTS_DEVMISS;          /*!< (@ 0x00000118) No device address match occurred on the last
                                                 *                  received packet                                            */
        __IOM uint32_t EVENTS_RSSIEND;          /*!< (@ 0x0000011C) Sampling of receive signal strength complete               */
        __IM uint32_t RESERVED2[ 2 ];
        __IOM uint32_t EVENTS_BCMATCH;          /*!< (@ 0x00000128) Bit counter reached bit count value                        */
        __IM uint32_t RESERVED3;
        __IOM uint32_t EVENTS_CRCOK;            /*!< (@ 0x00000130) Packet received with CRC ok                                */
        __IOM uint32_t EVENTS_CRCERROR;         /*!< (@ 0x00000134) Packet received with CRC error                             */
        __IOM uint32_t EVENTS_FRAMESTART;       /*!< (@ 0x00000138) IEEE 802.15.4 length field received                        */
        __IOM uint32_t EVENTS_EDEND;            /*!< (@ 0x0000013C) Sampling of energy detection complete. A new
                                                 *                  ED sample is ready for readout from the
                                                 *                  RADIO.EDSAMPLE register.                                   */
        __IOM uint32_t EVENTS_EDSTOPPED;        /*!< (@ 0x00000140) The sampling of energy detection has stopped               */
        __IOM uint32_t EVENTS_CCAIDLE;          /*!< (@ 0x00000144) Wireless medium in idle - clear to send                    */
        __IOM uint32_t EVENTS_CCABUSY;          /*!< (@ 0x00000148) Wireless medium busy - do not send                         */
        __IOM uint32_t EVENTS_CCASTOPPED;       /*!< (@ 0x0000014C) The CCA has stopped                                        */
        __IOM uint32_t EVENTS_RATEBOOST;        /*!< (@ 0x00000150) Ble_LR CI field received, receive mode is changed
                                                 *                  from Ble_LR125Kbit to Ble_LR500Kbit.                       */
        __IOM uint32_t EVENTS_TXREADY;          /*!< (@ 0x00000154) RADIO has ramped up and is ready to be started
                                                 *                  TX path                                                    */
        __IOM uint32_t EVENTS_RXREADY;          /*!< (@ 0x00000158) RADIO has ramped up and is ready to be started
                                                 *                  RX path                                                    */
        __IOM uint32_t EVENTS_MHRMATCH;         /*!< (@ 0x0000015C) MAC header match found                                     */
        __IM uint32_t RESERVED4[ 2 ];
        __IOM uint32_t EVENTS_SYNC;             /*!< (@ 0x00000168) Preamble indicator                                         */
        __IOM uint32_t EVENTS_PHYEND;           /*!< (@ 0x0000016C) Generated when last bit is sent on air, or received
                                                 *                  from air                                                   */
        __IOM uint32_t EVENTS_CTEPRESENT;       /*!< (@ 0x00000170) CTE is present (early warning right after receiving
                                                 *                  CTEInfo byte)                                              */
        __IM uint32_t RESERVED5[ 3 ];
        __IOM uint32_t PUBLISH_READY;           /*!< (@ 0x00000180) Publish configuration for event READY                      */
        __IOM uint32_t PUBLISH_ADDRESS;         /*!< (@ 0x00000184) Publish configuration for event ADDRESS                    */
        __IOM uint32_t PUBLISH_PAYLOAD;         /*!< (@ 0x00000188) Publish configuration for event PAYLOAD                    */
        __IOM uint32_t PUBLISH_END;             /*!< (@ 0x0000018C) Publish configuration for event END                        */
        __IOM uint32_t PUBLISH_DISABLED;        /*!< (@ 0x00000190) Publish configuration for event DISABLED                   */
        __IOM uint32_t PUBLISH_DEVMATCH;        /*!< (@ 0x00000194) Publish configuration for event DEVMATCH                   */
        __IOM uint32_t PUBLISH_DEVMISS;         /*!< (@ 0x00000198) Publish configuration for event DEVMISS                    */
        __IOM uint32_t PUBLISH_RSSIEND;         /*!< (@ 0x0000019C) Publish configuration for event RSSIEND                    */
        __IM uint32_t RESERVED6[ 2 ];
        __IOM uint32_t PUBLISH_BCMATCH;         /*!< (@ 0x000001A8) Publish configuration for event BCMATCH                    */
        __IM uint32_t RESERVED7;
        __IOM uint32_t PUBLISH_CRCOK;           /*!< (@ 0x000001B0) Publish configuration for event CRCOK                      */
        __IOM uint32_t PUBLISH_CRCERROR;        /*!< (@ 0x000001B4) Publish configuration for event CRCERROR                   */
        __IOM uint32_t PUBLISH_FRAMESTART;      /*!< (@ 0x000001B8) Publish configuration for event FRAMESTART                 */
        __IOM uint32_t PUBLISH_EDEND;           /*!< (@ 0x000001BC) Publish configuration for event EDEND                      */
        __IOM uint32_t PUBLISH_EDSTOPPED;       /*!< (@ 0x000001C0) Publish configuration for event EDSTOPPED                  */
        __IOM uint32_t PUBLISH_CCAIDLE;         /*!< (@ 0x000001C4) Publish configuration for event CCAIDLE                    */
        __IOM uint32_t PUBLISH_CCABUSY;         /*!< (@ 0x000001C8) Publish configuration for event CCABUSY                    */
        __IOM uint32_t PUBLISH_CCASTOPPED;      /*!< (@ 0x000001CC) Publish configuration for event CCASTOPPED                 */
        __IOM uint32_t PUBLISH_RATEBOOST;       /*!< (@ 0x000001D0) Publish configuration for event RATEBOOST                  */
        __IOM uint32_t PUBLISH_TXREADY;         /*!< (@ 0x000001D4) Publish configuration for event TXREADY                    */
        __IOM uint32_t PUBLISH_RXREADY;         /*!< (@ 0x000001D8) Publish configuration for event RXREADY                    */
        __IOM uint32_t PUBLISH_MHRMATCH;        /*!< (@ 0x000001DC) Publish configuration for event MHRMATCH                   */
        __IM uint32_t RESERVED8[ 2 ];
        __IOM uint32_t PUBLISH_SYNC;            /*!< (@ 0x000001E8) Publish configuration for event SYNC                       */
        __IOM uint32_t PUBLISH_PHYEND;          /*!< (@ 0x000001EC) Publish configuration for event PHYEND                     */
        __IOM uint32_t PUBLISH_CTEPRESENT;      /*!< (@ 0x000001F0) Publish configuration for event CTEPRESENT                 */
        __IM uint32_t RESERVED9[ 3 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED10[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED11[ 61 ];
        __IM uint32_t CRCSTATUS;                /*!< (@ 0x00000400) CRC status                                                 */
        __IM uint32_t RESERVED12;
        __IM uint32_t RXMATCH;                  /*!< (@ 0x00000408) Received address                                           */
        __IM uint32_t RXCRC;                    /*!< (@ 0x0000040C) CRC field of previously received packet                    */
        __IM uint32_t DAI;                      /*!< (@ 0x00000410) Device address match index                                 */
        __IM uint32_t PDUSTAT;                  /*!< (@ 0x00000414) Payload status                                             */
        __IM uint32_t RESERVED13[ 13 ];
        __IM uint32_t CTESTATUS;                /*!< (@ 0x0000044C) CTEInfo parsed from received packet                        */
        __IM uint32_t RESERVED14[ 2 ];
        __IM uint32_t DFESTATUS;                /*!< (@ 0x00000458) DFE status information                                     */
        __IM uint32_t RESERVED15[ 42 ];
        __IOM uint32_t PACKETPTR;               /*!< (@ 0x00000504) Packet pointer                                             */
        __IOM uint32_t FREQUENCY;               /*!< (@ 0x00000508) Frequency                                                  */
        __IOM uint32_t TXPOWER;                 /*!< (@ 0x0000050C) Output power                                               */
        __IOM uint32_t MODE;                    /*!< (@ 0x00000510) Data rate and modulation                                   */
        __IOM uint32_t PCNF0;                   /*!< (@ 0x00000514) Packet configuration register 0                            */
        __IOM uint32_t PCNF1;                   /*!< (@ 0x00000518) Packet configuration register 1                            */
        __IOM uint32_t BASE0;                   /*!< (@ 0x0000051C) Base address 0                                             */
        __IOM uint32_t BASE1;                   /*!< (@ 0x00000520) Base address 1                                             */
        __IOM uint32_t PREFIX0;                 /*!< (@ 0x00000524) Prefixes bytes for logical addresses 0-3                   */
        __IOM uint32_t PREFIX1;                 /*!< (@ 0x00000528) Prefixes bytes for logical addresses 4-7                   */
        __IOM uint32_t TXADDRESS;               /*!< (@ 0x0000052C) Transmit address select                                    */
        __IOM uint32_t RXADDRESSES;             /*!< (@ 0x00000530) Receive address select                                     */
        __IOM uint32_t CRCCNF;                  /*!< (@ 0x00000534) CRC configuration                                          */
        __IOM uint32_t CRCPOLY;                 /*!< (@ 0x00000538) CRC polynomial                                             */
        __IOM uint32_t CRCINIT;                 /*!< (@ 0x0000053C) CRC initial value                                          */
        __IM uint32_t RESERVED16;
        __IOM uint32_t TIFS;                    /*!< (@ 0x00000544) Interframe spacing in us                                   */
        __IM uint32_t RSSISAMPLE;               /*!< (@ 0x00000548) RSSI sample                                                */
        __IM uint32_t RESERVED17;
        __IM uint32_t STATE;                    /*!< (@ 0x00000550) Current radio state                                        */
        __IOM uint32_t DATAWHITEIV;             /*!< (@ 0x00000554) Data whitening initial value                               */
        __IM uint32_t RESERVED18[ 2 ];
        __IOM uint32_t BCC;                     /*!< (@ 0x00000560) Bit counter compare                                        */
        __IM uint32_t RESERVED19[ 39 ];
        __IOM uint32_t DAB[ 8 ];                /*!< (@ 0x00000600) Description collection: Device address base segment
                                                 *                  n                                                          */
        __IOM uint32_t DAP[ 8 ];                /*!< (@ 0x00000620) Description collection: Device address prefix
                                                 *                  n                                                          */
        __IOM uint32_t DACNF;                   /*!< (@ 0x00000640) Device address match configuration                         */
        __IOM uint32_t MHRMATCHCONF;            /*!< (@ 0x00000644) Search pattern configuration                               */
        __IOM uint32_t MHRMATCHMAS;             /*!< (@ 0x00000648) Pattern mask                                               */
        __IM uint32_t RESERVED20;
        __IOM uint32_t MODECNF0;                /*!< (@ 0x00000650) Radio mode configuration register 0                        */
        __IM uint32_t RESERVED21[ 3 ];
        __IOM uint32_t SFD;                     /*!< (@ 0x00000660) IEEE 802.15.4 start of frame delimiter                     */
        __IOM uint32_t EDCNT;                   /*!< (@ 0x00000664) IEEE 802.15.4 energy detect loop count                     */
        __IM uint32_t EDSAMPLE;                 /*!< (@ 0x00000668) IEEE 802.15.4 energy detect level                          */
        __IOM uint32_t CCACTRL;                 /*!< (@ 0x0000066C) IEEE 802.15.4 clear channel assessment control             */
        __IM uint32_t RESERVED22[ 164 ];
        __IOM uint32_t DFEMODE;                 /*!< (@ 0x00000900) Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure
                                                 *                  (AOD)                                                      */
        __IOM uint32_t CTEINLINECONF;           /*!< (@ 0x00000904) Configuration for CTE inline mode                          */
        __IM uint32_t RESERVED23[ 2 ];
        __IOM uint32_t DFECTRL1;                /*!< (@ 0x00000910) Various configuration for Direction finding                */
        __IOM uint32_t DFECTRL2;                /*!< (@ 0x00000914) Start offset for Direction finding                         */
        __IM uint32_t RESERVED24[ 4 ];
        __IOM uint32_t SWITCHPATTERN;           /*!< (@ 0x00000928) GPIO patterns to be used for each antenna                  */
        __IOM uint32_t CLEARPATTERN;            /*!< (@ 0x0000092C) Clear the GPIO pattern array for antenna control           */
        __IOM RADIO_PSEL_Type PSEL;             /*!< (@ 0x00000930) Unspecified                                                */
        __IOM RADIO_DFEPACKET_Type DFEPACKET;   /*!< (@ 0x00000950) DFE packet EasyDMA channel                                 */
        __IM uint32_t RESERVED25[ 424 ];
        __IOM uint32_t POWER;                   /*!< (@ 0x00000FFC) Peripheral power control                                   */
    } NRF_RADIO_Type;                           /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                          RNG_NS                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Random Number Generator (RNG_NS)
 */

    typedef struct                              /*!< (@ 0x41009000) RNG_NS Structure                                           */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Task starting the random number generator                  */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Task stopping the random number generator                  */
        __IM uint32_t RESERVED[ 30 ];
        __IOM uint32_t SUBSCRIBE_START;         /*!< (@ 0x00000080) Subscribe configuration for task START                     */
        __IOM uint32_t SUBSCRIBE_STOP;          /*!< (@ 0x00000084) Subscribe configuration for task STOP                      */
        __IM uint32_t RESERVED1[ 30 ];
        __IOM uint32_t EVENTS_VALRDY;           /*!< (@ 0x00000100) Event being generated for every new random number
                                                 *                  written to the VALUE register                              */
        __IM uint32_t RESERVED2[ 31 ];
        __IOM uint32_t PUBLISH_VALRDY;          /*!< (@ 0x00000180) Publish configuration for event VALRDY                     */
        __IM uint32_t RESERVED3[ 31 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED4[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED5[ 126 ];
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000504) Configuration register                                     */
        __IM uint32_t VALUE;                    /*!< (@ 0x00000508) Output random number                                       */
    } NRF_RNG_Type;                             /*!< Size = 1292 (0x50c)                                                       */



