FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network.h
/* =========================================================================================================================== */
/* ================                                         GPIOTE_NS                                         ================ */
/* =========================================================================================================================== */


/**
 * @brief GPIO Tasks and Events (GPIOTE_NS)
 */

    typedef struct                              /*!< (@ 0x4100A000) GPIOTE_NS Structure                                        */
    {
        __OM uint32_t TASKS_OUT[ 8 ];           /*!< (@ 0x00000000) Description collection: Task for writing to pin
                                                 *                  specified in CONFIG[n].PSEL. Action on pin
                                                 *                  is configured in CONFIG[n].POLARITY.                       */
        __IM uint32_t RESERVED[ 4 ];
        __OM uint32_t TASKS_SET[ 8 ];           /*!< (@ 0x00000030) Description collection: Task for writing to pin
                                                 *                  specified in CONFIG[n].PSEL. Action on pin
                                                 *                  is to set it high.                                         */
        __IM uint32_t RESERVED1[ 4 ];
        __OM uint32_t TASKS_CLR[ 8 ];           /*!< (@ 0x00000060) Description collection: Task for writing to pin
                                                 *                  specified in CONFIG[n].PSEL. Action on pin
                                                 *                  is to set it low.                                          */
        __IOM uint32_t SUBSCRIBE_OUT[ 8 ];      /*!< (@ 0x00000080) Description collection: Subscribe configuration
                                                 *                  for task OUT[n]                                            */
        __IM uint32_t RESERVED2[ 4 ];
        __IOM uint32_t SUBSCRIBE_SET[ 8 ];      /*!< (@ 0x000000B0) Description collection: Subscribe configuration
                                                 *                  for task SET[n]                                            */
        __IM uint32_t RESERVED3[ 4 ];
        __IOM uint32_t SUBSCRIBE_CLR[ 8 ];      /*!< (@ 0x000000E0) Description collection: Subscribe configuration
                                                 *                  for task CLR[n]                                            */
        __IOM uint32_t EVENTS_IN[ 8 ];          /*!< (@ 0x00000100) Description collection: Event generated from
                                                 *                  pin specified in CONFIG[n].PSEL                            */
        __IM uint32_t RESERVED4[ 23 ];
        __IOM uint32_t EVENTS_PORT;             /*!< (@ 0x0000017C) Event generated from multiple input GPIO pins
                                                 *                  with SENSE mechanism enabled                               */
        __IOM uint32_t PUBLISH_IN[ 8 ];         /*!< (@ 0x00000180) Description collection: Publish configuration
                                                 *                  for event IN[n]                                            */
        __IM uint32_t RESERVED5[ 23 ];
        __IOM uint32_t PUBLISH_PORT;            /*!< (@ 0x000001FC) Publish configuration for event PORT                       */
        __IM uint32_t RESERVED6[ 65 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED7[ 126 ];
        __IOM uint32_t LATENCY;                 /*!< (@ 0x00000504) Latency selection for Event mode (MODE=Event)
                                                 *                  with rising or falling edge detection on
                                                 *                  the pin.                                                   */
        __IM uint32_t RESERVED8[ 2 ];
        __IOM uint32_t CONFIG[ 8 ];             /*!< (@ 0x00000510) Description collection: Configuration for OUT[n],
                                                 *                  SET[n], and CLR[n] tasks and IN[n] event                   */
    } NRF_GPIOTE_Type;                          /*!< Size = 1328 (0x530)                                                       */



/* =========================================================================================================================== */
/* ================                                          WDT_NS                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Watchdog Timer (WDT_NS)
 */

    typedef struct                              /*!< (@ 0x4100B000) WDT_NS Structure                                           */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Start WDT                                                  */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Stop WDT                                                   */
        __IM uint32_t RESERVED[ 30 ];
        __IOM uint32_t SUBSCRIBE_START;         /*!< (@ 0x00000080) Subscribe configuration for task START                     */
        __IOM uint32_t SUBSCRIBE_STOP;          /*!< (@ 0x00000084) Subscribe configuration for task STOP                      */
        __IM uint32_t RESERVED1[ 30 ];
        __IOM uint32_t EVENTS_TIMEOUT;          /*!< (@ 0x00000100) Watchdog timeout                                           */
        __IOM uint32_t EVENTS_STOPPED;          /*!< (@ 0x00000104) Watchdog stopped                                           */
        __IM uint32_t RESERVED2[ 30 ];
        __IOM uint32_t PUBLISH_TIMEOUT;         /*!< (@ 0x00000180) Publish configuration for event TIMEOUT                    */
        __IOM uint32_t PUBLISH_STOPPED;         /*!< (@ 0x00000184) Publish configuration for event STOPPED                    */
        __IM uint32_t RESERVED3[ 95 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED4[ 6 ];
        __IOM uint32_t NMIENSET;                /*!< (@ 0x00000324) Enable interrupt                                           */
        __IOM uint32_t NMIENCLR;                /*!< (@ 0x00000328) Disable interrupt                                          */
        __IM uint32_t RESERVED5[ 53 ];
        __IM uint32_t RUNSTATUS;                /*!< (@ 0x00000400) Run status                                                 */
        __IM uint32_t REQSTATUS;                /*!< (@ 0x00000404) Request status                                             */
        __IM uint32_t RESERVED6[ 63 ];
        __IOM uint32_t CRV;                     /*!< (@ 0x00000504) Counter reload value                                       */
        __IOM uint32_t RREN;                    /*!< (@ 0x00000508) Enable register for reload request registers               */
        __IOM uint32_t CONFIG;                  /*!< (@ 0x0000050C) Configuration register                                     */
        __IM uint32_t RESERVED7[ 4 ];
        __OM uint32_t TSEN;                     /*!< (@ 0x00000520) Task stop enable                                           */
        __IM uint32_t RESERVED8[ 55 ];
        __OM uint32_t RR[ 8 ];                  /*!< (@ 0x00000600) Description collection: Reload request n                   */
    } NRF_WDT_Type;                             /*!< Size = 1568 (0x620)                                                       */



/* =========================================================================================================================== */
/* ================                                         TIMER0_NS                                         ================ */
/* =========================================================================================================================== */


/**
 * @brief Timer/Counter 0 (TIMER0_NS)
 */

    typedef struct                              /*!< (@ 0x4100C000) TIMER0_NS Structure                                        */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Start Timer                                                */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Stop Timer                                                 */
        __OM uint32_t TASKS_COUNT;              /*!< (@ 0x00000008) Increment Timer (Counter mode only)                        */
        __OM uint32_t TASKS_CLEAR;              /*!< (@ 0x0000000C) Clear time                                                 */
        __OM uint32_t TASKS_SHUTDOWN;           /*!< (@ 0x00000010) Deprecated register - Shut down timer                      */
        __IM uint32_t RESERVED[ 11 ];
        __OM uint32_t TASKS_CAPTURE[ 8 ];       /*!< (@ 0x00000040) Description collection: Capture Timer value to
                                                 *                  CC[n] register                                             */
        __IM uint32_t RESERVED1[ 8 ];
        __IOM uint32_t SUBSCRIBE_START;         /*!< (@ 0x00000080) Subscribe configuration for task START                     */
        __IOM uint32_t SUBSCRIBE_STOP;          /*!< (@ 0x00000084) Subscribe configuration for task STOP                      */
        __IOM uint32_t SUBSCRIBE_COUNT;         /*!< (@ 0x00000088) Subscribe configuration for task COUNT                     */
        __IOM uint32_t SUBSCRIBE_CLEAR;         /*!< (@ 0x0000008C) Subscribe configuration for task CLEAR                     */
        __IOM uint32_t SUBSCRIBE_SHUTDOWN;      /*!< (@ 0x00000090) Deprecated register - Subscribe configuration
                                                 *                  for task SHUTDOWN                                          */
        __IM uint32_t RESERVED2[ 11 ];
        __IOM uint32_t SUBSCRIBE_CAPTURE[ 8 ];  /*!< (@ 0x000000C0) Description collection: Subscribe configuration
                                                 *                  for task CAPTURE[n]                                        */
        __IM uint32_t RESERVED3[ 24 ];
        __IOM uint32_t EVENTS_COMPARE[ 8 ];     /*!< (@ 0x00000140) Description collection: Compare event on CC[n]
                                                 *                  match                                                      */
        __IM uint32_t RESERVED4[ 24 ];
        __IOM uint32_t PUBLISH_COMPARE[ 8 ];    /*!< (@ 0x000001C0) Description collection: Publish configuration
                                                 *                  for event COMPARE[n]                                       */
        __IM uint32_t RESERVED5[ 8 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED6[ 63 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED7[ 126 ];
        __IOM uint32_t MODE;                    /*!< (@ 0x00000504) Timer mode selection                                       */
        __IOM uint32_t BITMODE;                 /*!< (@ 0x00000508) Configure the number of bits used by the TIMER             */
        __IM uint32_t RESERVED8;
        __IOM uint32_t PRESCALER;               /*!< (@ 0x00000510) Timer prescaler register                                   */
        __IM uint32_t RESERVED9[ 11 ];
        __IOM uint32_t CC[ 8 ];                 /*!< (@ 0x00000540) Description collection: Capture/Compare register
                                                 *                  n                                                          */
        __IM uint32_t RESERVED10[ 8 ];
        __IOM uint32_t ONESHOTEN[ 8 ];          /*!< (@ 0x00000580) Description collection: Enable one-shot operation
                                                 *                  for Capture/Compare channel n                              */
    } NRF_TIMER_Type;                           /*!< Size = 1440 (0x5a0)                                                       */



/* =========================================================================================================================== */
/* ================                                          ECB_NS                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief AES ECB Mode Encryption (ECB_NS)
 */

    typedef struct                              /*!< (@ 0x4100D000) ECB_NS Structure                                           */
    {
        __OM uint32_t TASKS_STARTECB;           /*!< (@ 0x00000000) Start ECB block encrypt                                    */
        __OM uint32_t TASKS_STOPECB;            /*!< (@ 0x00000004) Abort a possible executing ECB operation                   */
        __IM uint32_t RESERVED[ 30 ];
        __IOM uint32_t SUBSCRIBE_STARTECB;      /*!< (@ 0x00000080) Subscribe configuration for task STARTECB                  */
        __IOM uint32_t SUBSCRIBE_STOPECB;       /*!< (@ 0x00000084) Subscribe configuration for task STOPECB                   */
        __IM uint32_t RESERVED1[ 30 ];
        __IOM uint32_t EVENTS_ENDECB;           /*!< (@ 0x00000100) ECB block encrypt complete                                 */
        __IOM uint32_t EVENTS_ERRORECB;         /*!< (@ 0x00000104) ECB block encrypt aborted because of a STOPECB
                                                 *                  task or due to an error                                    */
        __IM uint32_t RESERVED2[ 30 ];
        __IOM uint32_t PUBLISH_ENDECB;          /*!< (@ 0x00000180) Publish configuration for event ENDECB                     */
        __IOM uint32_t PUBLISH_ERRORECB;        /*!< (@ 0x00000184) Publish configuration for event ERRORECB                   */
        __IM uint32_t RESERVED3[ 95 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED4[ 126 ];
        __IOM uint32_t ECBDATAPTR;              /*!< (@ 0x00000504) ECB block encrypt memory pointers                          */
    } NRF_ECB_Type;                             /*!< Size = 1288 (0x508)                                                       */



/* =========================================================================================================================== */
/* ================                                          AAR_NS                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Accelerated Address Resolver (AAR_NS)
 */

