FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network.h
    typedef struct                              /*!< (@ 0x4100E000) AAR_NS Structure                                           */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Start resolving addresses based on IRKs specified
                                                 *                  in the IRK data structure                                  */
        __IM uint32_t RESERVED;
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000008) Stop resolving addresses                                   */
        __IM uint32_t RESERVED1[ 29 ];
        __IOM uint32_t SUBSCRIBE_START;         /*!< (@ 0x00000080) Subscribe configuration for task START                     */
        __IM uint32_t RESERVED2;
        __IOM uint32_t SUBSCRIBE_STOP;          /*!< (@ 0x00000088) Subscribe configuration for task STOP                      */
        __IM uint32_t RESERVED3[ 29 ];
        __IOM uint32_t EVENTS_END;              /*!< (@ 0x00000100) Address resolution procedure complete                      */
        __IOM uint32_t EVENTS_RESOLVED;         /*!< (@ 0x00000104) Address resolved                                           */
        __IOM uint32_t EVENTS_NOTRESOLVED;      /*!< (@ 0x00000108) Address not resolved                                       */
        __IM uint32_t RESERVED4[ 29 ];
        __IOM uint32_t PUBLISH_END;             /*!< (@ 0x00000180) Publish configuration for event END                        */
        __IOM uint32_t PUBLISH_RESOLVED;        /*!< (@ 0x00000184) Publish configuration for event RESOLVED                   */
        __IOM uint32_t PUBLISH_NOTRESOLVED;     /*!< (@ 0x00000188) Publish configuration for event NOTRESOLVED                */
        __IM uint32_t RESERVED5[ 94 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED6[ 61 ];
        __IM uint32_t STATUS;                   /*!< (@ 0x00000400) Resolution status                                          */
        __IM uint32_t RESERVED7[ 63 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable AAR                                                 */
        __IOM uint32_t NIRK;                    /*!< (@ 0x00000504) Number of IRKs                                             */
        __IOM uint32_t IRKPTR;                  /*!< (@ 0x00000508) Pointer to IRK data structure                              */
        __IM uint32_t RESERVED8;
        __IOM uint32_t ADDRPTR;                 /*!< (@ 0x00000510) Pointer to the resolvable address                          */
        __IOM uint32_t SCRATCHPTR;              /*!< (@ 0x00000514) Pointer to data area used for temporary storage            */
    } NRF_AAR_Type;                             /*!< Size = 1304 (0x518)                                                       */



/* =========================================================================================================================== */
/* ================                                          CCM_NS                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief AES CCM mode encryption (CCM_NS)
 */

    typedef struct                              /*!< (@ 0x4100E000) CCM_NS Structure                                           */
    {
        __OM uint32_t TASKS_KSGEN;              /*!< (@ 0x00000000) Start generation of keystream. This operation
                                                 *                  will stop by itself when completed.                        */
        __OM uint32_t TASKS_CRYPT;              /*!< (@ 0x00000004) Start encryption/decryption. This operation will
                                                 *                  stop by itself when completed.                             */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000008) Stop encryption/decryption                                 */
        __OM uint32_t TASKS_RATEOVERRIDE;       /*!< (@ 0x0000000C) Override DATARATE setting in MODE register with
                                                 *                  the contents of the RATEOVERRIDE register
                                                 *                  for any ongoing encryption/decryption                      */
        __IM uint32_t RESERVED[ 28 ];
        __IOM uint32_t SUBSCRIBE_KSGEN;         /*!< (@ 0x00000080) Subscribe configuration for task KSGEN                     */
        __IOM uint32_t SUBSCRIBE_CRYPT;         /*!< (@ 0x00000084) Subscribe configuration for task CRYPT                     */
        __IOM uint32_t SUBSCRIBE_STOP;          /*!< (@ 0x00000088) Subscribe configuration for task STOP                      */
        __IOM uint32_t SUBSCRIBE_RATEOVERRIDE;  /*!< (@ 0x0000008C) Subscribe configuration for task RATEOVERRIDE              */
        __IM uint32_t RESERVED1[ 28 ];
        __IOM uint32_t EVENTS_ENDKSGEN;         /*!< (@ 0x00000100) Keystream generation complete                              */
        __IOM uint32_t EVENTS_ENDCRYPT;         /*!< (@ 0x00000104) Encrypt/decrypt complete                                   */
        __IOM uint32_t EVENTS_ERROR;            /*!< (@ 0x00000108) Deprecated register - CCM error event                      */
        __IM uint32_t RESERVED2[ 29 ];
        __IOM uint32_t PUBLISH_ENDKSGEN;        /*!< (@ 0x00000180) Publish configuration for event ENDKSGEN                   */
        __IOM uint32_t PUBLISH_ENDCRYPT;        /*!< (@ 0x00000184) Publish configuration for event ENDCRYPT                   */
        __IOM uint32_t PUBLISH_ERROR;           /*!< (@ 0x00000188) Deprecated register - Publish configuration for
                                                 *                  event ERROR                                                */
        __IM uint32_t RESERVED3[ 29 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED4[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED5[ 61 ];
        __IM uint32_t MICSTATUS;                /*!< (@ 0x00000400) MIC check result                                           */
        __IM uint32_t RESERVED6[ 63 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable                                                     */
        __IOM uint32_t MODE;                    /*!< (@ 0x00000504) Operation mode                                             */
        __IOM uint32_t CNFPTR;                  /*!< (@ 0x00000508) Pointer to data structure holding the AES key
                                                 *                  and the NONCE vector                                       */
        __IOM uint32_t INPTR;                   /*!< (@ 0x0000050C) Input pointer                                              */
        __IOM uint32_t OUTPTR;                  /*!< (@ 0x00000510) Output pointer                                             */
        __IOM uint32_t SCRATCHPTR;              /*!< (@ 0x00000514) Pointer to data area used for temporary storage            */
        __IOM uint32_t MAXPACKETSIZE;           /*!< (@ 0x00000518) Length of keystream generated when MODE.LENGTH
                                                 *                  = Extended                                                 */
        __IOM uint32_t RATEOVERRIDE;            /*!< (@ 0x0000051C) Data rate override setting.                                */
        __IOM uint32_t HEADERMASK;              /*!< (@ 0x00000520) Header (S0) mask.                                          */
    } NRF_CCM_Type;                             /*!< Size = 1316 (0x524)                                                       */



/* =========================================================================================================================== */
/* ================                                         DPPIC_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Distributed programmable peripheral interconnect controller (DPPIC_NS)
 */

