FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network.h
    typedef struct                                         /*!< (@ 0x4100F000) DPPIC_NS Structure                                         */
    {
        __OM DPPIC_TASKS_CHG_Type TASKS_CHG[ 6 ];          /*!< (@ 0x00000000) Channel group tasks                                        */
        __IM uint32_t RESERVED[ 20 ];
        __IOM DPPIC_SUBSCRIBE_CHG_Type SUBSCRIBE_CHG[ 6 ]; /*!< (@ 0x00000080) Subscribe configuration for tasks                        */
        __IM uint32_t RESERVED1[ 276 ];
        __IOM uint32_t CHEN;                               /*!< (@ 0x00000500) Channel enable register                                    */
        __IOM uint32_t CHENSET;                            /*!< (@ 0x00000504) Channel enable set register                                */
        __IOM uint32_t CHENCLR;                            /*!< (@ 0x00000508) Channel enable clear register                              */
        __IM uint32_t RESERVED2[ 189 ];
        __IOM uint32_t CHG[ 6 ];                           /*!< (@ 0x00000800) Description collection: Channel group n Note:
                                                            *                  Writes to this register are ignored if either
                                                            *                  SUBSCRIBE_CHG[n].EN or SUBSCRIBE_CHG[n].DIS
                                                            *                  is enabled                                                 */
    } NRF_DPPIC_Type;                                      /*!< Size = 2072 (0x818)                                                       */



/* =========================================================================================================================== */
/* ================                                          TEMP_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Temperature Sensor (TEMP_NS)
 */

    typedef struct                              /*!< (@ 0x41010000) TEMP_NS Structure                                          */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Start temperature measurement                              */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Stop temperature measurement                               */
        __IM uint32_t RESERVED[ 30 ];
        __IOM uint32_t SUBSCRIBE_START;         /*!< (@ 0x00000080) Subscribe configuration for task START                     */
        __IOM uint32_t SUBSCRIBE_STOP;          /*!< (@ 0x00000084) Subscribe configuration for task STOP                      */
        __IM uint32_t RESERVED1[ 30 ];
        __IOM uint32_t EVENTS_DATARDY;          /*!< (@ 0x00000100) Temperature measurement complete, data ready               */
        __IM uint32_t RESERVED2[ 31 ];
        __IOM uint32_t PUBLISH_DATARDY;         /*!< (@ 0x00000180) Publish configuration for event DATARDY                    */
        __IM uint32_t RESERVED3[ 96 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED4[ 127 ];
        __IM int32_t TEMP;                      /*!< (@ 0x00000508) Temperature in degC (0.25deg steps)                        */
        __IM uint32_t RESERVED5[ 5 ];
        __IOM uint32_t A0;                      /*!< (@ 0x00000520) Slope of first piecewise linear function                   */
        __IOM uint32_t A1;                      /*!< (@ 0x00000524) Slope of second piecewise linear function                  */
        __IOM uint32_t A2;                      /*!< (@ 0x00000528) Slope of third piecewise linear function                   */
        __IOM uint32_t A3;                      /*!< (@ 0x0000052C) Slope of fourth piecewise linear function                  */
        __IOM uint32_t A4;                      /*!< (@ 0x00000530) Slope of fifth piecewise linear function                   */
        __IOM uint32_t A5;                      /*!< (@ 0x00000534) Slope of sixth piecewise linear function                   */
        __IM uint32_t RESERVED6[ 2 ];
        __IOM uint32_t B0;                      /*!< (@ 0x00000540) y-intercept of first piecewise linear function             */
        __IOM uint32_t B1;                      /*!< (@ 0x00000544) y-intercept of second piecewise linear function            */
        __IOM uint32_t B2;                      /*!< (@ 0x00000548) y-intercept of third piecewise linear function             */
        __IOM uint32_t B3;                      /*!< (@ 0x0000054C) y-intercept of fourth piecewise linear function            */
        __IOM uint32_t B4;                      /*!< (@ 0x00000550) y-intercept of fifth piecewise linear function             */
        __IOM uint32_t B5;                      /*!< (@ 0x00000554) y-intercept of sixth piecewise linear function             */
        __IM uint32_t RESERVED7[ 2 ];
        __IOM uint32_t T0;                      /*!< (@ 0x00000560) Endpoint of first piecewise linear function                */
        __IOM uint32_t T1;                      /*!< (@ 0x00000564) Endpoint of second piecewise linear function               */
        __IOM uint32_t T2;                      /*!< (@ 0x00000568) Endpoint of third piecewise linear function                */
        __IOM uint32_t T3;                      /*!< (@ 0x0000056C) Endpoint of fourth piecewise linear function               */
        __IOM uint32_t T4;                      /*!< (@ 0x00000570) Endpoint of fifth piecewise linear function                */
    } NRF_TEMP_Type;                            /*!< Size = 1396 (0x574)                                                       */



/* =========================================================================================================================== */
/* ================                                          RTC0_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Real-time counter 0 (RTC0_NS)
 */

