FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network.h
    typedef struct                              /*!< (@ 0x41011000) RTC0_NS Structure                                          */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Start RTC counter                                          */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Stop RTC counter                                           */
        __OM uint32_t TASKS_CLEAR;              /*!< (@ 0x00000008) Clear RTC counter                                          */
        __OM uint32_t TASKS_TRIGOVRFLW;         /*!< (@ 0x0000000C) Set counter to 0xFFFFF0                                    */
        __IM uint32_t RESERVED[ 12 ];
        __OM uint32_t TASKS_CAPTURE[ 4 ];       /*!< (@ 0x00000040) Description collection: Capture RTC counter to
                                                 *                  CC[n] register                                             */
        __IM uint32_t RESERVED1[ 12 ];
        __IOM uint32_t SUBSCRIBE_START;         /*!< (@ 0x00000080) Subscribe configuration for task START                     */
        __IOM uint32_t SUBSCRIBE_STOP;          /*!< (@ 0x00000084) Subscribe configuration for task STOP                      */
        __IOM uint32_t SUBSCRIBE_CLEAR;         /*!< (@ 0x00000088) Subscribe configuration for task CLEAR                     */
        __IOM uint32_t SUBSCRIBE_TRIGOVRFLW;    /*!< (@ 0x0000008C) Subscribe configuration for task TRIGOVRFLW                */
        __IM uint32_t RESERVED2[ 12 ];
        __IOM uint32_t SUBSCRIBE_CAPTURE[ 4 ];  /*!< (@ 0x000000C0) Description collection: Subscribe configuration
                                                 *                  for task CAPTURE[n]                                        */
        __IM uint32_t RESERVED3[ 12 ];
        __IOM uint32_t EVENTS_TICK;             /*!< (@ 0x00000100) Event on counter increment                                 */
        __IOM uint32_t EVENTS_OVRFLW;           /*!< (@ 0x00000104) Event on counter overflow                                  */
        __IM uint32_t RESERVED4[ 14 ];
        __IOM uint32_t EVENTS_COMPARE[ 4 ];     /*!< (@ 0x00000140) Description collection: Compare event on CC[n]
                                                 *                  match                                                      */
        __IM uint32_t RESERVED5[ 12 ];
        __IOM uint32_t PUBLISH_TICK;            /*!< (@ 0x00000180) Publish configuration for event TICK                       */
        __IOM uint32_t PUBLISH_OVRFLW;          /*!< (@ 0x00000184) Publish configuration for event OVRFLW                     */
        __IM uint32_t RESERVED6[ 14 ];
        __IOM uint32_t PUBLISH_COMPARE[ 4 ];    /*!< (@ 0x000001C0) Description collection: Publish configuration
                                                 *                  for event COMPARE[n]                                       */
        __IM uint32_t RESERVED7[ 12 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED8[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED9[ 13 ];
        __IOM uint32_t EVTEN;                   /*!< (@ 0x00000340) Enable or disable event routing                            */
        __IOM uint32_t EVTENSET;                /*!< (@ 0x00000344) Enable event routing                                       */
        __IOM uint32_t EVTENCLR;                /*!< (@ 0x00000348) Disable event routing                                      */
        __IM uint32_t RESERVED10[ 110 ];
        __IM uint32_t COUNTER;                  /*!< (@ 0x00000504) Current counter value                                      */
        __IOM uint32_t PRESCALER;               /*!< (@ 0x00000508) 12-bit prescaler for counter frequency (32768
                                                 *                  / (PRESCALER + 1)). Must be written when
                                                 *                  RTC is stopped.                                            */
        __IM uint32_t RESERVED11[ 13 ];
        __IOM uint32_t CC[ 4 ];                 /*!< (@ 0x00000540) Description collection: Compare register n                 */
    } NRF_RTC_Type;                             /*!< Size = 1360 (0x550)                                                       */



/* =========================================================================================================================== */
/* ================                                          IPC_NS                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Interprocessor communication (IPC_NS)
 */

    typedef struct                              /*!< (@ 0x41012000) IPC_NS Structure                                           */
    {
        __OM uint32_t TASKS_SEND[ 16 ];         /*!< (@ 0x00000000) Description collection: Trigger events on IPC
                                                 *                  channel enabled in SEND_CNF[n]                             */
        __IM uint32_t RESERVED[ 16 ];
        __IOM uint32_t SUBSCRIBE_SEND[ 16 ];    /*!< (@ 0x00000080) Description collection: Subscribe configuration
                                                 *                  for task SEND[n]                                           */
        __IM uint32_t RESERVED1[ 16 ];
        __IOM uint32_t EVENTS_RECEIVE[ 16 ];    /*!< (@ 0x00000100) Description collection: Event received on one
                                                 *                  or more of the enabled IPC channels in RECEIVE_CNF[n]      */
        __IM uint32_t RESERVED2[ 16 ];
        __IOM uint32_t PUBLISH_RECEIVE[ 16 ];   /*!< (@ 0x00000180) Description collection: Publish configuration
                                                 *                  for event RECEIVE[n]                                       */
        __IM uint32_t RESERVED3[ 80 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t INTPEND;                  /*!< (@ 0x0000030C) Pending interrupts                                         */
        __IM uint32_t RESERVED4[ 128 ];
        __IOM uint32_t SEND_CNF[ 16 ];          /*!< (@ 0x00000510) Description collection: Send event configuration
                                                 *                  for TASKS_SEND[n]                                          */
        __IM uint32_t RESERVED5[ 16 ];
        __IOM uint32_t RECEIVE_CNF[ 16 ];       /*!< (@ 0x00000590) Description collection: Receive event configuration
                                                 *                  for EVENTS_RECEIVE[n]                                      */
        __IM uint32_t RESERVED6[ 16 ];
        __IOM uint32_t GPMEM[ 2 ];              /*!< (@ 0x00000610) Description collection: General purpose memory             */
    } NRF_IPC_Type;                             /*!< Size = 1560 (0x618)                                                       */



/* =========================================================================================================================== */
/* ================                                         SPIM0_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Serial Peripheral Interface Master with EasyDMA (SPIM0_NS)
 */

