FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network.h
    typedef struct                              /*!< (@ 0x41013000) SPIM0_NS Structure                                         */
    {
        __IM uint32_t RESERVED[ 4 ];
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000010) Start SPI transaction                                      */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000014) Stop SPI transaction                                       */
        __IM uint32_t RESERVED1;
        __OM uint32_t TASKS_SUSPEND;            /*!< (@ 0x0000001C) Suspend SPI transaction                                    */
        __OM uint32_t TASKS_RESUME;             /*!< (@ 0x00000020) Resume SPI transaction                                     */
        __IM uint32_t RESERVED2[ 27 ];
        __IOM uint32_t SUBSCRIBE_START;         /*!< (@ 0x00000090) Subscribe configuration for task START                     */
        __IOM uint32_t SUBSCRIBE_STOP;          /*!< (@ 0x00000094) Subscribe configuration for task STOP                      */
        __IM uint32_t RESERVED3;
        __IOM uint32_t SUBSCRIBE_SUSPEND;       /*!< (@ 0x0000009C) Subscribe configuration for task SUSPEND                   */
        __IOM uint32_t SUBSCRIBE_RESUME;        /*!< (@ 0x000000A0) Subscribe configuration for task RESUME                    */
        __IM uint32_t RESERVED4[ 24 ];
        __IOM uint32_t EVENTS_STOPPED;          /*!< (@ 0x00000104) SPI transaction has stopped                                */
        __IM uint32_t RESERVED5[ 2 ];
        __IOM uint32_t EVENTS_ENDRX;            /*!< (@ 0x00000110) End of RXD buffer reached                                  */
        __IM uint32_t RESERVED6;
        __IOM uint32_t EVENTS_END;              /*!< (@ 0x00000118) End of RXD buffer and TXD buffer reached                   */
        __IM uint32_t RESERVED7;
        __IOM uint32_t EVENTS_ENDTX;            /*!< (@ 0x00000120) End of TXD buffer reached                                  */
        __IM uint32_t RESERVED8[ 10 ];
        __IOM uint32_t EVENTS_STARTED;          /*!< (@ 0x0000014C) Transaction started                                        */
        __IM uint32_t RESERVED9[ 13 ];
        __IOM uint32_t PUBLISH_STOPPED;         /*!< (@ 0x00000184) Publish configuration for event STOPPED                    */
        __IM uint32_t RESERVED10[ 2 ];
        __IOM uint32_t PUBLISH_ENDRX;           /*!< (@ 0x00000190) Publish configuration for event ENDRX                      */
        __IM uint32_t RESERVED11;
        __IOM uint32_t PUBLISH_END;             /*!< (@ 0x00000198) Publish configuration for event END                        */
        __IM uint32_t RESERVED12;
        __IOM uint32_t PUBLISH_ENDTX;           /*!< (@ 0x000001A0) Publish configuration for event ENDTX                      */
        __IM uint32_t RESERVED13[ 10 ];
        __IOM uint32_t PUBLISH_STARTED;         /*!< (@ 0x000001CC) Publish configuration for event STARTED                    */
        __IM uint32_t RESERVED14[ 12 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED15[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED16[ 61 ];
        __IOM uint32_t STALLSTAT;               /*!< (@ 0x00000400) Stall status for EasyDMA RAM accesses. The fields
                                                 *                  in this register are set to STALL by hardware
                                                 *                  whenever a stall occurres and can be cleared
                                                 *                  (set to NOSTALL) by the CPU.                               */
        __IM uint32_t RESERVED17[ 63 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable SPIM                                                */
        __IM uint32_t RESERVED18;
        __IOM SPIM_PSEL_Type PSEL;              /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED19[ 3 ];
        __IOM uint32_t FREQUENCY;               /*!< (@ 0x00000524) SPI frequency. Accuracy depends on the HFCLK
                                                 *                  source selected.                                           */
        __IM uint32_t RESERVED20[ 3 ];
        __IOM SPIM_RXD_Type RXD;                /*!< (@ 0x00000534) RXD EasyDMA channel                                        */
        __IOM SPIM_TXD_Type TXD;                /*!< (@ 0x00000544) TXD EasyDMA channel                                        */
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000554) Configuration register                                     */
        __IM uint32_t RESERVED21[ 2 ];
        __IOM SPIM_IFTIMING_Type IFTIMING;      /*!< (@ 0x00000560) Unspecified                                                */
        __IOM uint32_t CSNPOL;                  /*!< (@ 0x00000568) Polarity of CSN output                                     */
        __IOM uint32_t PSELDCX;                 /*!< (@ 0x0000056C) Pin select for DCX signal                                  */
        __IOM uint32_t DCXCNT;                  /*!< (@ 0x00000570) DCX configuration                                          */
        __IM uint32_t RESERVED22[ 19 ];
        __IOM uint32_t ORC;                     /*!< (@ 0x000005C0) Byte transmitted after TXD.MAXCNT bytes have
                                                 *                  been transmitted in the case when RXD.MAXCNT
                                                 *                  is greater than TXD.MAXCNT                                 */
    } NRF_SPIM_Type;                            /*!< Size = 1476 (0x5c4)                                                       */



/* =========================================================================================================================== */
/* ================                                         SPIS0_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief SPI Slave (SPIS0_NS)
 */

    typedef struct                              /*!< (@ 0x41013000) SPIS0_NS Structure                                         */
    {
        __IM uint32_t RESERVED[ 9 ];
        __OM uint32_t TASKS_ACQUIRE;            /*!< (@ 0x00000024) Acquire SPI semaphore                                      */
        __OM uint32_t TASKS_RELEASE;            /*!< (@ 0x00000028) Release SPI semaphore, enabling the SPI slave
                                                 *                  to acquire it                                              */
        __IM uint32_t RESERVED1[ 30 ];
        __IOM uint32_t SUBSCRIBE_ACQUIRE;       /*!< (@ 0x000000A4) Subscribe configuration for task ACQUIRE                   */
        __IOM uint32_t SUBSCRIBE_RELEASE;       /*!< (@ 0x000000A8) Subscribe configuration for task RELEASE                   */
        __IM uint32_t RESERVED2[ 22 ];
        __IOM uint32_t EVENTS_END;              /*!< (@ 0x00000104) Granted transaction completed                              */
        __IM uint32_t RESERVED3[ 2 ];
        __IOM uint32_t EVENTS_ENDRX;            /*!< (@ 0x00000110) End of RXD buffer reached                                  */
        __IM uint32_t RESERVED4[ 5 ];
        __IOM uint32_t EVENTS_ACQUIRED;         /*!< (@ 0x00000128) Semaphore acquired                                         */
        __IM uint32_t RESERVED5[ 22 ];
        __IOM uint32_t PUBLISH_END;             /*!< (@ 0x00000184) Publish configuration for event END                        */
        __IM uint32_t RESERVED6[ 2 ];
        __IOM uint32_t PUBLISH_ENDRX;           /*!< (@ 0x00000190) Publish configuration for event ENDRX                      */
        __IM uint32_t RESERVED7[ 5 ];
        __IOM uint32_t PUBLISH_ACQUIRED;        /*!< (@ 0x000001A8) Publish configuration for event ACQUIRED                   */
        __IM uint32_t RESERVED8[ 21 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED9[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED10[ 61 ];
        __IM uint32_t SEMSTAT;                  /*!< (@ 0x00000400) Semaphore status register                                  */
        __IM uint32_t RESERVED11[ 15 ];
        __IOM uint32_t STATUS;                  /*!< (@ 0x00000440) Status from last transaction                               */
        __IM uint32_t RESERVED12[ 47 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable SPI slave                                           */
        __IM uint32_t RESERVED13;
        __IOM SPIS_PSEL_Type PSEL;              /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED14[ 7 ];
        __IOM SPIS_RXD_Type RXD;                /*!< (@ 0x00000534) Unspecified                                                */
        __IOM SPIS_TXD_Type TXD;                /*!< (@ 0x00000544) Unspecified                                                */
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000554) Configuration register                                     */
        __IM uint32_t RESERVED15;
        __IOM uint32_t DEF;                     /*!< (@ 0x0000055C) Default character. Character clocked out in case
                                                 *                  of an ignored transaction.                                 */
        __IM uint32_t RESERVED16[ 24 ];
        __IOM uint32_t ORC;                     /*!< (@ 0x000005C0) Over-read character                                        */
    } NRF_SPIS_Type;                            /*!< Size = 1476 (0x5c4)                                                       */



/* =========================================================================================================================== */
/* ================                                         TWIM0_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief I2C compatible Two-Wire Master Interface with EasyDMA (TWIM0_NS)
 */

    typedef struct                              /*!< (@ 0x41013000) TWIM0_NS Structure                                         */
    {
        __OM uint32_t TASKS_STARTRX;            /*!< (@ 0x00000000) Start TWI receive sequence                                 */
        __IM uint32_t RESERVED;
        __OM uint32_t TASKS_STARTTX;            /*!< (@ 0x00000008) Start TWI transmit sequence                                */
        __IM uint32_t RESERVED1[ 2 ];
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000014) Stop TWI transaction. Must be issued while the
                                                 *                  TWI master is not suspended.                               */
        __IM uint32_t RESERVED2;
        __OM uint32_t TASKS_SUSPEND;            /*!< (@ 0x0000001C) Suspend TWI transaction                                    */
        __OM uint32_t TASKS_RESUME;             /*!< (@ 0x00000020) Resume TWI transaction                                     */
        __IM uint32_t RESERVED3[ 23 ];
        __IOM uint32_t SUBSCRIBE_STARTRX;       /*!< (@ 0x00000080) Subscribe configuration for task STARTRX                   */
        __IM uint32_t RESERVED4;
        __IOM uint32_t SUBSCRIBE_STARTTX;       /*!< (@ 0x00000088) Subscribe configuration for task STARTTX                   */
        __IM uint32_t RESERVED5[ 2 ];
        __IOM uint32_t SUBSCRIBE_STOP;          /*!< (@ 0x00000094) Subscribe configuration for task STOP                      */
        __IM uint32_t RESERVED6;
        __IOM uint32_t SUBSCRIBE_SUSPEND;       /*!< (@ 0x0000009C) Subscribe configuration for task SUSPEND                   */
        __IOM uint32_t SUBSCRIBE_RESUME;        /*!< (@ 0x000000A0) Subscribe configuration for task RESUME                    */
        __IM uint32_t RESERVED7[ 24 ];
        __IOM uint32_t EVENTS_STOPPED;          /*!< (@ 0x00000104) TWI stopped                                                */
        __IM uint32_t RESERVED8[ 7 ];
        __IOM uint32_t EVENTS_ERROR;            /*!< (@ 0x00000124) TWI error                                                  */
        __IM uint32_t RESERVED9[ 8 ];
        __IOM uint32_t EVENTS_SUSPENDED;        /*!< (@ 0x00000148) SUSPEND task has been issued, TWI traffic is
                                                 *                  now suspended.                                             */
        __IOM uint32_t EVENTS_RXSTARTED;        /*!< (@ 0x0000014C) Receive sequence started                                   */
        __IOM uint32_t EVENTS_TXSTARTED;        /*!< (@ 0x00000150) Transmit sequence started                                  */
        __IM uint32_t RESERVED10[ 2 ];
        __IOM uint32_t EVENTS_LASTRX;           /*!< (@ 0x0000015C) Byte boundary, starting to receive the last byte           */
        __IOM uint32_t EVENTS_LASTTX;           /*!< (@ 0x00000160) Byte boundary, starting to transmit the last
                                                 *                  byte                                                       */
        __IM uint32_t RESERVED11[ 8 ];
        __IOM uint32_t PUBLISH_STOPPED;         /*!< (@ 0x00000184) Publish configuration for event STOPPED                    */
        __IM uint32_t RESERVED12[ 7 ];
        __IOM uint32_t PUBLISH_ERROR;           /*!< (@ 0x000001A4) Publish configuration for event ERROR                      */
        __IM uint32_t RESERVED13[ 8 ];
        __IOM uint32_t PUBLISH_SUSPENDED;       /*!< (@ 0x000001C8) Publish configuration for event SUSPENDED                  */
        __IOM uint32_t PUBLISH_RXSTARTED;       /*!< (@ 0x000001CC) Publish configuration for event RXSTARTED                  */
        __IOM uint32_t PUBLISH_TXSTARTED;       /*!< (@ 0x000001D0) Publish configuration for event TXSTARTED                  */
        __IM uint32_t RESERVED14[ 2 ];
        __IOM uint32_t PUBLISH_LASTRX;          /*!< (@ 0x000001DC) Publish configuration for event LASTRX                     */
        __IOM uint32_t PUBLISH_LASTTX;          /*!< (@ 0x000001E0) Publish configuration for event LASTTX                     */
        __IM uint32_t RESERVED15[ 7 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED16[ 63 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED17[ 110 ];
        __IOM uint32_t ERRORSRC;                /*!< (@ 0x000004C4) Error source                                               */
        __IM uint32_t RESERVED18[ 14 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable TWIM                                                */
        __IM uint32_t RESERVED19;
        __IOM TWIM_PSEL_Type PSEL;              /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED20[ 5 ];
        __IOM uint32_t FREQUENCY;               /*!< (@ 0x00000524) TWI frequency. Accuracy depends on the HFCLK
                                                 *                  source selected.                                           */
        __IM uint32_t RESERVED21[ 3 ];
        __IOM TWIM_RXD_Type RXD;                /*!< (@ 0x00000534) RXD EasyDMA channel                                        */
        __IOM TWIM_TXD_Type TXD;                /*!< (@ 0x00000544) TXD EasyDMA channel                                        */
        __IM uint32_t RESERVED22[ 13 ];
        __IOM uint32_t ADDRESS;                 /*!< (@ 0x00000588) Address used in the TWI transfer                           */
    } NRF_TWIM_Type;                            /*!< Size = 1420 (0x58c)                                                       */



/* =========================================================================================================================== */
/* ================                                         TWIS0_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief I2C compatible Two-Wire Slave Interface with EasyDMA (TWIS0_NS)
 */

