FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network.h
    typedef struct                              /*!< (@ 0x41013000) TWIS0_NS Structure                                         */
    {
        __IM uint32_t RESERVED[ 5 ];
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000014) Stop TWI transaction                                       */
        __IM uint32_t RESERVED1;
        __OM uint32_t TASKS_SUSPEND;            /*!< (@ 0x0000001C) Suspend TWI transaction                                    */
        __OM uint32_t TASKS_RESUME;             /*!< (@ 0x00000020) Resume TWI transaction                                     */
        __IM uint32_t RESERVED2[ 3 ];
        __OM uint32_t TASKS_PREPARERX;          /*!< (@ 0x00000030) Prepare the TWI slave to respond to a write command        */
        __OM uint32_t TASKS_PREPARETX;          /*!< (@ 0x00000034) Prepare the TWI slave to respond to a read command         */
        __IM uint32_t RESERVED3[ 23 ];
        __IOM uint32_t SUBSCRIBE_STOP;          /*!< (@ 0x00000094) Subscribe configuration for task STOP                      */
        __IM uint32_t RESERVED4;
        __IOM uint32_t SUBSCRIBE_SUSPEND;       /*!< (@ 0x0000009C) Subscribe configuration for task SUSPEND                   */
        __IOM uint32_t SUBSCRIBE_RESUME;        /*!< (@ 0x000000A0) Subscribe configuration for task RESUME                    */
        __IM uint32_t RESERVED5[ 3 ];
        __IOM uint32_t SUBSCRIBE_PREPARERX;     /*!< (@ 0x000000B0) Subscribe configuration for task PREPARERX                 */
        __IOM uint32_t SUBSCRIBE_PREPARETX;     /*!< (@ 0x000000B4) Subscribe configuration for task PREPARETX                 */
        __IM uint32_t RESERVED6[ 19 ];
        __IOM uint32_t EVENTS_STOPPED;          /*!< (@ 0x00000104) TWI stopped                                                */
        __IM uint32_t RESERVED7[ 7 ];
        __IOM uint32_t EVENTS_ERROR;            /*!< (@ 0x00000124) TWI error                                                  */
        __IM uint32_t RESERVED8[ 9 ];
        __IOM uint32_t EVENTS_RXSTARTED;        /*!< (@ 0x0000014C) Receive sequence started                                   */
        __IOM uint32_t EVENTS_TXSTARTED;        /*!< (@ 0x00000150) Transmit sequence started                                  */
        __IM uint32_t RESERVED9[ 4 ];
        __IOM uint32_t EVENTS_WRITE;            /*!< (@ 0x00000164) Write command received                                     */
        __IOM uint32_t EVENTS_READ;             /*!< (@ 0x00000168) Read command received                                      */
        __IM uint32_t RESERVED10[ 6 ];
        __IOM uint32_t PUBLISH_STOPPED;         /*!< (@ 0x00000184) Publish configuration for event STOPPED                    */
        __IM uint32_t RESERVED11[ 7 ];
        __IOM uint32_t PUBLISH_ERROR;           /*!< (@ 0x000001A4) Publish configuration for event ERROR                      */
        __IM uint32_t RESERVED12[ 9 ];
        __IOM uint32_t PUBLISH_RXSTARTED;       /*!< (@ 0x000001CC) Publish configuration for event RXSTARTED                  */
        __IOM uint32_t PUBLISH_TXSTARTED;       /*!< (@ 0x000001D0) Publish configuration for event TXSTARTED                  */
        __IM uint32_t RESERVED13[ 4 ];
        __IOM uint32_t PUBLISH_WRITE;           /*!< (@ 0x000001E4) Publish configuration for event WRITE                      */
        __IOM uint32_t PUBLISH_READ;            /*!< (@ 0x000001E8) Publish configuration for event READ                       */
        __IM uint32_t RESERVED14[ 5 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED15[ 63 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED16[ 113 ];
        __IOM uint32_t ERRORSRC;                /*!< (@ 0x000004D0) Error source                                               */
        __IM uint32_t MATCH;                    /*!< (@ 0x000004D4) Status register indicating which address had
                                                 *                  a match                                                    */
        __IM uint32_t RESERVED17[ 10 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable TWIS                                                */
        __IM uint32_t RESERVED18;
        __IOM TWIS_PSEL_Type PSEL;              /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED19[ 9 ];
        __IOM TWIS_RXD_Type RXD;                /*!< (@ 0x00000534) RXD EasyDMA channel                                        */
        __IOM TWIS_TXD_Type TXD;                /*!< (@ 0x00000544) TXD EasyDMA channel                                        */
        __IM uint32_t RESERVED20[ 13 ];
        __IOM uint32_t ADDRESS[ 2 ];            /*!< (@ 0x00000588) Description collection: TWI slave address n                */
        __IM uint32_t RESERVED21;
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000594) Configuration register for the address match
                                                 *                  mechanism                                                  */
        __IM uint32_t RESERVED22[ 10 ];
        __IOM uint32_t ORC;                     /*!< (@ 0x000005C0) Over-read character. Character sent out in case
                                                 *                  of an over-read of the transmit buffer.                    */
    } NRF_TWIS_Type;                            /*!< Size = 1476 (0x5c4)                                                       */



/* =========================================================================================================================== */
/* ================                                         UARTE0_NS                                         ================ */
/* =========================================================================================================================== */


/**
 * @brief UART with EasyDMA (UARTE0_NS)
 */

    typedef struct                              /*!< (@ 0x41013000) UARTE0_NS Structure                                        */
    {
        __OM uint32_t TASKS_STARTRX;            /*!< (@ 0x00000000) Start UART receiver                                        */
        __OM uint32_t TASKS_STOPRX;             /*!< (@ 0x00000004) Stop UART receiver                                         */
        __OM uint32_t TASKS_STARTTX;            /*!< (@ 0x00000008) Start UART transmitter                                     */
        __OM uint32_t TASKS_STOPTX;             /*!< (@ 0x0000000C) Stop UART transmitter                                      */
        __IM uint32_t RESERVED[ 7 ];
        __OM uint32_t TASKS_FLUSHRX;            /*!< (@ 0x0000002C) Flush RX FIFO into RX buffer                               */
        __IM uint32_t RESERVED1[ 20 ];
        __IOM uint32_t SUBSCRIBE_STARTRX;       /*!< (@ 0x00000080) Subscribe configuration for task STARTRX                   */
        __IOM uint32_t SUBSCRIBE_STOPRX;        /*!< (@ 0x00000084) Subscribe configuration for task STOPRX                    */
        __IOM uint32_t SUBSCRIBE_STARTTX;       /*!< (@ 0x00000088) Subscribe configuration for task STARTTX                   */
        __IOM uint32_t SUBSCRIBE_STOPTX;        /*!< (@ 0x0000008C) Subscribe configuration for task STOPTX                    */
        __IM uint32_t RESERVED2[ 7 ];
        __IOM uint32_t SUBSCRIBE_FLUSHRX;       /*!< (@ 0x000000AC) Subscribe configuration for task FLUSHRX                   */
        __IM uint32_t RESERVED3[ 20 ];
        __IOM uint32_t EVENTS_CTS;              /*!< (@ 0x00000100) CTS is activated (set low). Clear To Send.                 */
        __IOM uint32_t EVENTS_NCTS;             /*!< (@ 0x00000104) CTS is deactivated (set high). Not Clear To Send.          */
        __IOM uint32_t EVENTS_RXDRDY;           /*!< (@ 0x00000108) Data received in RXD (but potentially not yet
                                                 *                  transferred to Data RAM)                                   */
        __IM uint32_t RESERVED4;
        __IOM uint32_t EVENTS_ENDRX;            /*!< (@ 0x00000110) Receive buffer is filled up                                */
        __IM uint32_t RESERVED5[ 2 ];
        __IOM uint32_t EVENTS_TXDRDY;           /*!< (@ 0x0000011C) Data sent from TXD                                         */
        __IOM uint32_t EVENTS_ENDTX;            /*!< (@ 0x00000120) Last TX byte transmitted                                   */
        __IOM uint32_t EVENTS_ERROR;            /*!< (@ 0x00000124) Error detected                                             */
        __IM uint32_t RESERVED6[ 7 ];
        __IOM uint32_t EVENTS_RXTO;             /*!< (@ 0x00000144) Receiver timeout                                           */
        __IM uint32_t RESERVED7;
        __IOM uint32_t EVENTS_RXSTARTED;        /*!< (@ 0x0000014C) UART receiver has started                                  */
        __IOM uint32_t EVENTS_TXSTARTED;        /*!< (@ 0x00000150) UART transmitter has started                               */
        __IM uint32_t RESERVED8;
        __IOM uint32_t EVENTS_TXSTOPPED;        /*!< (@ 0x00000158) Transmitter stopped                                        */
        __IM uint32_t RESERVED9[ 9 ];
        __IOM uint32_t PUBLISH_CTS;             /*!< (@ 0x00000180) Publish configuration for event CTS                        */
        __IOM uint32_t PUBLISH_NCTS;            /*!< (@ 0x00000184) Publish configuration for event NCTS                       */
        __IOM uint32_t PUBLISH_RXDRDY;          /*!< (@ 0x00000188) Publish configuration for event RXDRDY                     */
        __IM uint32_t RESERVED10;
        __IOM uint32_t PUBLISH_ENDRX;           /*!< (@ 0x00000190) Publish configuration for event ENDRX                      */
        __IM uint32_t RESERVED11[ 2 ];
        __IOM uint32_t PUBLISH_TXDRDY;          /*!< (@ 0x0000019C) Publish configuration for event TXDRDY                     */
        __IOM uint32_t PUBLISH_ENDTX;           /*!< (@ 0x000001A0) Publish configuration for event ENDTX                      */
        __IOM uint32_t PUBLISH_ERROR;           /*!< (@ 0x000001A4) Publish configuration for event ERROR                      */
        __IM uint32_t RESERVED12[ 7 ];
        __IOM uint32_t PUBLISH_RXTO;            /*!< (@ 0x000001C4) Publish configuration for event RXTO                       */
        __IM uint32_t RESERVED13;
        __IOM uint32_t PUBLISH_RXSTARTED;       /*!< (@ 0x000001CC) Publish configuration for event RXSTARTED                  */
        __IOM uint32_t PUBLISH_TXSTARTED;       /*!< (@ 0x000001D0) Publish configuration for event TXSTARTED                  */
        __IM uint32_t RESERVED14;
        __IOM uint32_t PUBLISH_TXSTOPPED;       /*!< (@ 0x000001D8) Publish configuration for event TXSTOPPED                  */
        __IM uint32_t RESERVED15[ 9 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED16[ 63 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED17[ 93 ];
        __IOM uint32_t ERRORSRC;                /*!< (@ 0x00000480) Error source                                               */
        __IM uint32_t RESERVED18[ 31 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable UART                                                */
        __IM uint32_t RESERVED19;
        __IOM UARTE_PSEL_Type PSEL;             /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED20[ 3 ];
        __IOM uint32_t BAUDRATE;                /*!< (@ 0x00000524) Baud rate. Accuracy depends on the HFCLK source
                                                 *                  selected.                                                  */
        __IM uint32_t RESERVED21[ 3 ];
        __IOM UARTE_RXD_Type RXD;               /*!< (@ 0x00000534) RXD EasyDMA channel                                        */
        __IM uint32_t RESERVED22;
        __IOM UARTE_TXD_Type TXD;               /*!< (@ 0x00000544) TXD EasyDMA channel                                        */
        __IM uint32_t RESERVED23[ 7 ];
        __IOM uint32_t CONFIG;                  /*!< (@ 0x0000056C) Configuration of parity and hardware flow control          */
    } NRF_UARTE_Type;                           /*!< Size = 1392 (0x570)                                                       */



/* =========================================================================================================================== */
/* ================                                          EGU0_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Event generator unit (EGU0_NS)
 */

    typedef struct                              /*!< (@ 0x41014000) EGU0_NS Structure                                          */
    {
        __OM uint32_t TASKS_TRIGGER[ 16 ];      /*!< (@ 0x00000000) Description collection: Trigger n for triggering
                                                 *                  the corresponding TRIGGERED[n] event                       */
        __IM uint32_t RESERVED[ 16 ];
        __IOM uint32_t SUBSCRIBE_TRIGGER[ 16 ]; /*!< (@ 0x00000080) Description collection: Subscribe configuration
                                                 *                  for task TRIGGER[n]                                        */
        __IM uint32_t RESERVED1[ 16 ];
        __IOM uint32_t EVENTS_TRIGGERED[ 16 ];  /*!< (@ 0x00000100) Description collection: Event number n generated
                                                 *                  by triggering the corresponding TRIGGER[n]
                                                 *                  task                                                       */
        __IM uint32_t RESERVED2[ 16 ];
        __IOM uint32_t PUBLISH_TRIGGERED[ 16 ]; /*!< (@ 0x00000180) Description collection: Publish configuration
                                                 *                  for event TRIGGERED[n]                                     */
        __IM uint32_t RESERVED3[ 80 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
    } NRF_EGU_Type;                             /*!< Size = 780 (0x30c)                                                        */



/* =========================================================================================================================== */
/* ================                                          SWI0_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Software interrupt 0 (SWI0_NS)
 */

    typedef struct                              /*!< (@ 0x4101A000) SWI0_NS Structure                                          */
    {
        __IM uint32_t UNUSED;                   /*!< (@ 0x00000000) Unused.                                                    */
    } NRF_SWI_Type;                             /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                        APPMUTEX_NS                                        ================ */
/* =========================================================================================================================== */


/**
 * @brief MUTEX 0 (APPMUTEX_NS)
 */

    typedef struct                              /*!< (@ 0x40030000) APPMUTEX_NS Structure                                      */
    {
        __IM uint32_t RESERVED[ 256 ];
        __IOM uint32_t MUTEX[ 16 ];             /*!< (@ 0x00000400) Description collection: Mutex register                     */
    } NRF_MUTEX_Type;                           /*!< Size = 1088 (0x440)                                                       */



/* =========================================================================================================================== */
/* ================                                          ACL_NS                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Access control lists (ACL_NS)
 */

    typedef struct                              /*!< (@ 0x41080000) ACL_NS Structure                                           */
    {
        __IM uint32_t RESERVED[ 512 ];
        __IOM ACL_ACL_Type ACL[ 8 ];            /*!< (@ 0x00000800) Unspecified                                                */
    } NRF_ACL_Type;                             /*!< Size = 2176 (0x880)                                                       */



/* =========================================================================================================================== */
/* ================                                          NVMC_NS                                          ================ */
/* =========================================================================================================================== */


/**
 * @brief Non-volatile memory controller (NVMC_NS)
 */

    typedef struct                              /*!< (@ 0x41080000) NVMC_NS Structure                                          */
    {
        __IM uint32_t RESERVED[ 256 ];
        __IM uint32_t READY;                    /*!< (@ 0x00000400) Ready flag                                                 */
        __IM uint32_t RESERVED1;
        __IM uint32_t READYNEXT;                /*!< (@ 0x00000408) Ready flag                                                 */
        __IM uint32_t RESERVED2[ 62 ];
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000504) Configuration register                                     */
        __IM uint32_t RESERVED3;
        __OM uint32_t ERASEALL;                 /*!< (@ 0x0000050C) Register for erasing all non-volatile user memory          */
        __IM uint32_t RESERVED4[ 3 ];
        __IOM uint32_t ERASEPAGEPARTIALCFG;     /*!< (@ 0x0000051C) Register for partial erase configuration                   */
        __IM uint32_t RESERVED5[ 8 ];
        __IOM uint32_t ICACHECNF;               /*!< (@ 0x00000540) I-code cache configuration register                        */
        __IM uint32_t RESERVED6;
        __IOM uint32_t IHIT;                    /*!< (@ 0x00000548) I-code cache hit counter                                   */
        __IOM uint32_t IMISS;                   /*!< (@ 0x0000054C) I-code cache miss counter                                  */
    } NRF_NVMC_Type;                            /*!< Size = 1360 (0x550)                                                       */



/* =========================================================================================================================== */
/* ================                                          VMC_NS                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Volatile Memory controller (VMC_NS)
 */

    typedef struct                              /*!< (@ 0x41081000) VMC_NS Structure                                           */
    {
        __IM uint32_t RESERVED[ 384 ];
        __IOM VMC_RAM_Type RAM[ 4 ];            /*!< (@ 0x00000600) Unspecified                                                */
    } NRF_VMC_Type;                             /*!< Size = 1600 (0x640)                                                       */



/* =========================================================================================================================== */
/* ================                                           P0_NS                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief GPIO Port 0 (P0_NS)
 */

