FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network.h
    typedef struct                              /*!< (@ 0x418C0500) P0_NS Structure                                            */
    {
        __IM uint32_t RESERVED;
        __IOM uint32_t OUT;                     /*!< (@ 0x00000004) Write GPIO port                                            */
        __IOM uint32_t OUTSET;                  /*!< (@ 0x00000008) Set individual bits in GPIO port                           */
        __IOM uint32_t OUTCLR;                  /*!< (@ 0x0000000C) Clear individual bits in GPIO port                         */
        __IM uint32_t IN;                       /*!< (@ 0x00000010) Read GPIO port                                             */
        __IOM uint32_t DIR;                     /*!< (@ 0x00000014) Direction of GPIO pins                                     */
        __IOM uint32_t DIRSET;                  /*!< (@ 0x00000018) DIR set register                                           */
        __IOM uint32_t DIRCLR;                  /*!< (@ 0x0000001C) DIR clear register                                         */
        __IOM uint32_t LATCH;                   /*!< (@ 0x00000020) Latch register indicating what GPIO pins that
                                                 *                  have met the criteria set in the PIN_CNF[n].SENSE
                                                 *                  registers                                                  */
        __IOM uint32_t DETECTMODE;              /*!< (@ 0x00000024) Select between default DETECT signal behavior
                                                 *                  and LDETECT mode (For non-secure pin only)                 */
        __IOM uint32_t DETECTMODE_SEC;          /*!< (@ 0x00000028) Select between default DETECT signal behavior
                                                 *                  and LDETECT mode (For secure pin only)                     */
        __IM uint32_t RESERVED1[ 117 ];
        __IOM uint32_t PIN_CNF[ 32 ];           /*!< (@ 0x00000200) Description collection: Configuration of GPIO
                                                 *                  pins                                                       */
    } NRF_GPIO_Type;                            /*!< Size = 640 (0x280)                                                        */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
 * @{
 */

    #define NRF_FICR_NS_BASE        0x01FF0000UL
    #define NRF_UICR_NS_BASE        0x01FF8000UL
    #define NRF_CTI_NS_BASE         0xE0042000UL
    #define NRF_DCNF_NS_BASE        0x41000000UL
    #define NRF_VREQCTRL_NS_BASE    0x41004000UL
    #define NRF_CLOCK_NS_BASE       0x41005000UL
    #define NRF_POWER_NS_BASE       0x41005000UL
    #define NRF_RESET_NS_BASE       0x41005000UL
    #define NRF_CTRLAP_NS_BASE      0x41006000UL
    #define NRF_RADIO_NS_BASE       0x41008000UL
    #define NRF_RNG_NS_BASE         0x41009000UL
    #define NRF_GPIOTE_NS_BASE      0x4100A000UL
    #define NRF_WDT_NS_BASE         0x4100B000UL
    #define NRF_TIMER0_NS_BASE      0x4100C000UL
    #define NRF_ECB_NS_BASE         0x4100D000UL
    #define NRF_AAR_NS_BASE         0x4100E000UL
    #define NRF_CCM_NS_BASE         0x4100E000UL
    #define NRF_DPPIC_NS_BASE       0x4100F000UL
    #define NRF_TEMP_NS_BASE        0x41010000UL
    #define NRF_RTC0_NS_BASE        0x41011000UL
    #define NRF_IPC_NS_BASE         0x41012000UL
    #define NRF_SPIM0_NS_BASE       0x41013000UL
    #define NRF_SPIS0_NS_BASE       0x41013000UL
    #define NRF_TWIM0_NS_BASE       0x41013000UL
    #define NRF_TWIS0_NS_BASE       0x41013000UL
    #define NRF_UARTE0_NS_BASE      0x41013000UL
    #define NRF_EGU0_NS_BASE        0x41014000UL
    #define NRF_RTC1_NS_BASE        0x41016000UL
    #define NRF_TIMER1_NS_BASE      0x41018000UL
    #define NRF_TIMER2_NS_BASE      0x41019000UL
    #define NRF_SWI0_NS_BASE        0x4101A000UL
    #define NRF_SWI1_NS_BASE        0x4101B000UL
    #define NRF_SWI2_NS_BASE        0x4101C000UL
    #define NRF_SWI3_NS_BASE        0x4101D000UL
    #define NRF_APPMUTEX_NS_BASE    0x40030000UL
    #define NRF_APPMUTEX_S_BASE     0x50030000UL
    #define NRF_ACL_NS_BASE         0x41080000UL
    #define NRF_NVMC_NS_BASE        0x41080000UL
    #define NRF_VMC_NS_BASE         0x41081000UL
    #define NRF_P0_NS_BASE          0x418C0500UL
    #define NRF_P1_NS_BASE          0x418C0800UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
 * @{
 */

    #define NRF_FICR_NS        ( ( NRF_FICR_Type * ) NRF_FICR_NS_BASE )
    #define NRF_UICR_NS        ( ( NRF_UICR_Type * ) NRF_UICR_NS_BASE )
    #define NRF_CTI_NS         ( ( NRF_CTI_Type * ) NRF_CTI_NS_BASE )
    #define NRF_DCNF_NS        ( ( NRF_DCNF_Type * ) NRF_DCNF_NS_BASE )
    #define NRF_VREQCTRL_NS    ( ( NRF_VREQCTRL_Type * ) NRF_VREQCTRL_NS_BASE )
    #define NRF_CLOCK_NS       ( ( NRF_CLOCK_Type * ) NRF_CLOCK_NS_BASE )
    #define NRF_POWER_NS       ( ( NRF_POWER_Type * ) NRF_POWER_NS_BASE )
    #define NRF_RESET_NS       ( ( NRF_RESET_Type * ) NRF_RESET_NS_BASE )
    #define NRF_CTRLAP_NS      ( ( NRF_CTRLAPPERI_Type * ) NRF_CTRLAP_NS_BASE )
    #define NRF_RADIO_NS       ( ( NRF_RADIO_Type * ) NRF_RADIO_NS_BASE )
    #define NRF_RNG_NS         ( ( NRF_RNG_Type * ) NRF_RNG_NS_BASE )
    #define NRF_GPIOTE_NS      ( ( NRF_GPIOTE_Type * ) NRF_GPIOTE_NS_BASE )
    #define NRF_WDT_NS         ( ( NRF_WDT_Type * ) NRF_WDT_NS_BASE )
    #define NRF_TIMER0_NS      ( ( NRF_TIMER_Type * ) NRF_TIMER0_NS_BASE )
    #define NRF_ECB_NS         ( ( NRF_ECB_Type * ) NRF_ECB_NS_BASE )
    #define NRF_AAR_NS         ( ( NRF_AAR_Type * ) NRF_AAR_NS_BASE )
    #define NRF_CCM_NS         ( ( NRF_CCM_Type * ) NRF_CCM_NS_BASE )
    #define NRF_DPPIC_NS       ( ( NRF_DPPIC_Type * ) NRF_DPPIC_NS_BASE )
    #define NRF_TEMP_NS        ( ( NRF_TEMP_Type * ) NRF_TEMP_NS_BASE )
    #define NRF_RTC0_NS        ( ( NRF_RTC_Type * ) NRF_RTC0_NS_BASE )
    #define NRF_IPC_NS         ( ( NRF_IPC_Type * ) NRF_IPC_NS_BASE )
    #define NRF_SPIM0_NS       ( ( NRF_SPIM_Type * ) NRF_SPIM0_NS_BASE )
    #define NRF_SPIS0_NS       ( ( NRF_SPIS_Type * ) NRF_SPIS0_NS_BASE )
    #define NRF_TWIM0_NS       ( ( NRF_TWIM_Type * ) NRF_TWIM0_NS_BASE )
    #define NRF_TWIS0_NS       ( ( NRF_TWIS_Type * ) NRF_TWIS0_NS_BASE )
    #define NRF_UARTE0_NS      ( ( NRF_UARTE_Type * ) NRF_UARTE0_NS_BASE )
    #define NRF_EGU0_NS        ( ( NRF_EGU_Type * ) NRF_EGU0_NS_BASE )
    #define NRF_RTC1_NS        ( ( NRF_RTC_Type * ) NRF_RTC1_NS_BASE )
    #define NRF_TIMER1_NS      ( ( NRF_TIMER_Type * ) NRF_TIMER1_NS_BASE )
    #define NRF_TIMER2_NS      ( ( NRF_TIMER_Type * ) NRF_TIMER2_NS_BASE )
    #define NRF_SWI0_NS        ( ( NRF_SWI_Type * ) NRF_SWI0_NS_BASE )
    #define NRF_SWI1_NS        ( ( NRF_SWI_Type * ) NRF_SWI1_NS_BASE )
    #define NRF_SWI2_NS        ( ( NRF_SWI_Type * ) NRF_SWI2_NS_BASE )
    #define NRF_SWI3_NS        ( ( NRF_SWI_Type * ) NRF_SWI3_NS_BASE )
    #define NRF_APPMUTEX_NS    ( ( NRF_MUTEX_Type * ) NRF_APPMUTEX_NS_BASE )
    #define NRF_APPMUTEX_S     ( ( NRF_MUTEX_Type * ) NRF_APPMUTEX_S_BASE )
    #define NRF_ACL_NS         ( ( NRF_ACL_Type * ) NRF_ACL_NS_BASE )
    #define NRF_NVMC_NS        ( ( NRF_NVMC_Type * ) NRF_NVMC_NS_BASE )
    #define NRF_VMC_NS         ( ( NRF_VMC_Type * ) NRF_VMC_NS_BASE )
    #define NRF_P0_NS          ( ( NRF_GPIO_Type * ) NRF_P0_NS_BASE )
    #define NRF_P1_NS          ( ( NRF_GPIO_Type * ) NRF_P1_NS_BASE )

/** @} */ /* End of group Device_Peripheral_declaration */


    #ifdef __cplusplus
}
    #endif

#endif /* NRF5340_NETWORK_H */


/** @} */ /* End of group nrf5340_network */

/** @} */ /* End of group Nordic Semiconductor */
